{
  "data": [
    {
      "company_name": "Rolls Royce",
      "position": "Data Engineer",
      "req_experience": "-",
      "link": "https://rollsroyce.wd3.myworkdayjobs.com/Professional/job/Bangalore/Data-Engineer_JR6122789?utm_medium=jobboard&source=APPLICANT_SOURCE-3-19&utm_source=careercurvv",
      "company_logo": "assets/images/rolls royce.gif",
      "skill_vis_check": false,
      "req_skills": "",
      "location": "BLR",
      "status": "open",
      "job_type": "software",
      "job_description": [
        {
          "key": "Job Description",
          "value": [
            "At Rolls-Royce, we pioneer cutting-edge technologies that deliver the cleanest, safest and most competitive solutions to our planet’s vital power needs. We embrace the power of data and technology and aim to be Digital First in everything we do.",
            "To ensure we continue to be pioneers of our industry, Rolls-Royce has a team of over 16,500 engineers around the globe. They include everyone from world experts in their field to those who manage hundreds of people and millions of pounds worth of investments. We recruit engineers at all levels and in a range of disciplines. And while we encourage specialisation, we also offer freedom to cross-specialise and develop skills across a number of different areas.",
            "A data engineer works on implementing complex data projects with a focus on collecting, parsing, managing, analysing and visualising large sets of data to turn information into value using multiple platforms.",
            "You will work with business analysts and data scientists to understand customer business problems and needs, secure the data supply chain, implement analysis solutions and visualise outcomes that support improved decision making for a customer. You will understand how to apply technologies to solve data problems and to develop innovative data solutions."
          ]
        },
        {
          "key": "Key Accountabilities:",
          "value": [
            "Working with colleagues to understand and implement requirements.",
            "Securing the data supply chain, understanding how data is ingested from different sources and combined / transformed into a single data set.  Understanding how to analyse, cleanse, join and transform data.",
            "Implementing designed / specified solutions into the chosen platform (e.g. Azure Data Factories / Data Lakes, HDInsight, Talend, MuleSoft or traditional software).",
            "Working with colleagues to ensure that the infrastructure available is capable of meeting the solution requirements.",
            "Planning, designing and conducting tests of the implementations, correcting errors and re-testing to achieve an acceptable result.",
            "Appreciate how to manage the data including; security, archiving, structure and storage."
          ]
        },
        {
          "key": "Experience and Qualifications",
          "value": [
            "Relevant years of experience in implementing data warehouse, data engineering pipelines is a must.",
            "Experience with up to date with data technology capabilities e.g. Hadoop, Spark, Azure, PowerBI, Tableau is a must",
            "Experience or fair understanding of Devops CI/CD principles is desirable, using IaaS / PaaS / SaaS is desirable",
            "Experience with Microsoft development stack is desirable (C#.net) is desirable",
            "Experience with databases and data query tools & technologies (SQL, PL/SQL, NoSQL, MongoDB, Cassandra etc…) is a must.",
            "Experience with ETL tools such as SSIS, Talend, MuleSoft etc… is a must.",
            "Experience with time series data processing and storage including technologies such as InfluxDB, OpenTSDB etc… is desirable, scripting and automation such as Linux shell, PowerShell, R, Python etc.… is a must.",
            "Experience on both Microsoft and Linux operating systems is must, working in an agile environment, within a self-organising team. Experience with Visual Studio Team Services aka Azure Devops is desirable.",
            "Ability to investigate and resolve technical problems. Should be able to architect highly scalable distributed systems using traditional and cloud based software."
          ]
        }
      ],
      "id": 134
    },
    {
      "company_name": "Uber",
      "position": "Software Engineer - 2 Backend",
      "req_experience": "3+ years",
      "link": "https://www.uber.com/global/en/careers/list/134509/?iis=Job%20Board%20-%20Recruitment%20Marketing&iisn=LinkedIn&jClickId=2fd41411-6ff2-415f-b6e8-b0bc750742bc&utm_medium=jobboard&utm_source=careercurvv",
      "company_logo": "assets/images/uber.gif",
      "skill_vis_check": false,
      "req_skills": "",
      "location": "BLR",
      "status": "open",
      "job_type": "software",
      "job_description": [
        {
          "key": "About the Role",
          "value": [
            "Uber is changing the way people think about transportation. Not that long ago, we were just an app to request premium black cars in a few metropolitan areas. Now we’re a part of the logistical fabric of cities everywhere. Whether it’s a ride, a sandwich, or a package, we use technology to give people what they want, when they want it.",
            "We're looking for passionate developers to join the Rider Verticals, a cross-functional group in which Design, Data Science, Backend, Android, iOS and Web engineers work collaboratively to design and build products for riders to offer more options to choose from for their mobility needs, work on enhancing tech platforms and improve reliability of various core product offerings.",
            "At Uber, we take pride in offering the best quality service to our customers - you will collaborate closely with product managers and business operations teams to build for scale, yet focusing on providing intuitive and delightful customer experiences."
          ]
        },
        {
          "key": "What the Candidate Will Need / Bonus Points",
          "value": []
        },
        {
          "key": "What the Candidate Will Do",
          "value": [
            "As a software engineer, you’ll engage in product and engineering jam sessions conceptualising features and mapping them into a technical design. You will build software that will ship to millions of users, or thousands of fellow engineers growing multiple apps that directly impact the ease of our users’ lives.",
            "Work on Uber's most complex applications by designing, implementing, and unit testing the backend application code.",
            "Help teams with defining an architecture that would scale and also encourage best practices.",
            "Create frameworks and abstractions that are reliable, reusable and avoid surprising outcomes.",
            "Go to person to get clarity of problem statements and also can breakdown into meaningful tasks.",
            "Promote and demonstrate problem-specific expertise and execution excellence in delivering results"
          ]
        },
        {
          "key": "Basic Qualifications",
          "value": [
            "Bachelor's degree in Computer Science or related technical field or equivalent practical experience",
            "Strong expertise in high-level programming languages GoLang, Java etc",
            "Good experience in architecture design, high availability, and high-performance systems.",
            "Ability to learn quickly on the go. We're looking for software engineers who thrive while learning new technologies and don't believe in one-size-fits-all solutions.",
            "You should be able to easily adapt to meet the needs of our massive growth and rapidly evolving business environment."
          ]
        },
        {
          "key": "Preferred Qualifications",
          "value": [
            "Knowledge of data structure and algorithms and an ability to use them practically when implementing solutions",
            "Demonstrated experience working collaboratively in cross-functional teams",
            "Experience designing systems across the stack including close collaboration with frontend and mobile engineers"
          ]
        }
      ],
      "id": 133
    },
  {
    "company_name": "Oracle",
    "position": "Senior Software Developer",
    "req_experience": "3-5 years",
    "link": "https://careers.oracle.com/jobs/#en/sites/jobsearch/job/251973/?utm_medium=Jobboard&utm_source=careercurvv",
    "company_logo": "assets/images/oracle.gif",
    "skill_vis_check": false,
    "req_skills": "",
    "location": "BLR",
    "status": "open",
    "job_type": "software",
    "job_description": [
      {
        "key": "Responsibilities",
        "value": [
          "Autonomous Healthcheck Framework:",
          "In this era of cloud and big data computing, systems supporting complex IT environments become larger, more complex, and numerous, often with many hosts clustered into a single system or distributed among different data centers, it’s challenging to keep systems healthy and respond to problems quickly. With hundreds of interconnected components, misconfiguration can cause problems while running the system and has a serious business impact. When problems occur it can be difficult and time-consuming for those managing these systems to isolate the issue and know which diagnostics to collect. ",
          "Our team designed and develop the Autonomous Health Framework(AHF) product to monitor and keep the Oracle database infrastructure healthy and running. AHF has many components like Trace File Analyzer, ORAChk, EXAchk, CHM, hang manager, etc. EXAchk proactively checks the health of the database infrastructure to avoid any issues before it causes an outage. It is designed to do periodic runs and these runs produce lots of data about Database systems like versions, platforms, patches, parameters, network configurations, disk configuration, etc. We also build analytics and machine learning models based on the history of data gathered by the EXAchk component and which helps in providing predictions for resource usage and workload etc."
        ]
      },
      {
        "key": "Desired Skill Set:",
        "value": [
          " The candidate must have the following knowledge and experience:",
          "  Should have development experience of 3 - 5 years.",
          " Should be very good at Python ",
          " Should be very good at SQL, PL/SQL",
          " Solid foundation in data structures, algorithms",
          " Write clean code, test-driven development ",
          " Good understanding of the Unix operating system",
          "  Hands on experience in python ML libraries like Scikit learn, sklearn etc is value add",
          "  Good problem-solving skills",
          "  Knowledge of Version Control is a plus",
          "  Knowledge of Oracle database/GI stack is plus",
          "  Should be self-driven and result oriented",
          "  Should be good at Problem solving and Analytical Skills",
          "  Should be flexible and team contributor",
          "  Excellent written and verbal communication skills and the ability to communicate with individuals across the organization"
        ]
      }
    ],
    "id": 132
  },
  {
    "company_name": "LinkedIn",
    "position": "Software Engineer",
    "req_experience": "2+ years",
    "link": "https://www.linkedin.com/jobs/view/4001684730/",
    "company_logo": "assets/images/linkedin.gif",
    "skill_vis_check": false,
    "req_skills": "",
    "location": "BLR",
    "status": "open",
    "job_type": "software",
    "job_description": [
      {
        "key": "Responsibilities",
        "value": [
          "Scale distributed applications, make architectural trade-offs applying synchronous and asynchronous design patterns, write code, and deliver with speediness and quality.",
          "Develop multi-tier scalable, high-volume performing, and reliable user-centric applications that operate 24x7.",
          "Produce high quality software that is unit tested, code reviewed, and checked in regularly for continuous integration.",
          "Identify, leverage, and successfully evangelise opportunities to improve engineering productivity."
        ]
      },
      {
        "key": "Basic Qualifications:",
        "value": [
          "BA/BS Degree in Computer Science or related technical discipline, or related practical experience.",
          "2+ years experience programming experience in Java"
        ]
      },
      {
        "key": "Preferred Qualifications:",
        "value": [
          "3+ years of relevant work experience.",
          "Expert knowledge of computer science, with strong competencies in data structures, algorithms, and software design.",
          "Experience with object-oriented design, coding, testing patterns, and programming languages (Java, C++).",
          "Proven coding skills in a high level language with interest and ability to learn other coding languages as needed.",
          "Experience building web applications and services with IDEs and general development practices."
        ]
      }
    ],
    "id": 131
  },
  {
    "company_name": "siemens",
    "position": "Graduate Trainee Engineer",
    "req_experience": "0+ years",
    "link": "https://jobs.siemens.com/careers/job/563156120357624?hl=en&domain=siemens.com&sourceType=PREMIUM_POST_SITE",
    "company_logo": "assets/images/siemens.gif",
    "skill_vis_check": false,
    "req_skills": "",
    "location": "BLR",
    "status": "open",
    "job_type": "software",
    "job_description": [
      {
        "key": "Hello go-getter!",
        "value": [
          "We know that a business only thrives if our people are thriving. That’s why we always put our people first. Our global and diverse team would be happy to support you and challenge you to grow in many ways. Who knows where our joint journey will take you?",
          "Siemens Global Business Services (GBS) is a Siemens Service Company that provides innovative digital solutions and customer-oriented business services. With more than 20 years of experience, Siemens GBS taps into its understanding of how organizations and businesses work to seamlessly integrate, digitalize and optimize business processes with a portfolio that covers end-to-end business needs."
        ]
      },
      {
        "key": "You’ll make an impact by:",
        "value": [
          "As a key contributor to the Pega Nearshore Consulting team, you will work closely with Customer and Pega Architects to develop high quality deliverables across all phases (inception through user acceptance testing) that allow our customers to enhance the way they manage their business.",
          "Pega is changing the way the world builds software. In this role, you’ll help us design, develop, implement, and test the next generation of Pega products.",
          "This is your chance to get your hands-on leading customer and learning technology that figures out what people really care about.",
          " Actively participate in development and testing of the target industry framework(s) in Pega Infinity. Collaborate and team with Pega team remotely; continuously focus on Customer Success.",
          " Ensure customer success by effectively managing and delivering in different work environments by understanding the dynamics, timing, etc.",
          "Partner with both the client and the business team to develop high quality deliverables across all phases of a project, from participating in the requirements, design and build phases, delivering high-quality deliverables, through to user acceptance testing.",
          "Leverage your Educational experience to consult and influence the client's direction, in the pursuit of Pega best practices.",
          " Demonstrate your commitment to and enthusiasm for customer success by ensuring that the delivered product is fully-functioning, performs to business requirements defined and approved by the client, and meets or exceeds expectations."
        ]
      },
      {
        "key": "You’ll win us over by:",
        "value": [
          "You have Any 2 Programming language Hands on experience as per your previous Trainings.",
          "You have good knowledge about UI/UX.",
          "You have Hands on experience on working on projects.",
          "You understanding about Pega tool and know how pega can be useful.",
          "You are willing to work on Pega Tool.",
          "You have Completed some basic level of Pega training.",
          "You are willing to work for any kind of Role(s) using Pega tool.",
          "You have excellent communication skills.",
          "You have sound Object Oriented Programming Skills, like Inheritance concepts.",
          "You have good knowledge about java Script.",
          "You have knowledge about React."
        ]
      }
    ],
    "id": 130
  },
  {
    "company_name": "Coursera",
    "position": "Software Engineer - Backend",
    "req_experience": "2-5 years",
    "link": "https://www.linkedin.com/jobs/view/4000278873/",
    "company_logo": "assets/images/hiring.gif",
    "skill_vis_check": false,
    "req_skills": "",
    "location": "remote",
    "status": "open",
    "job_type": "software",
    "job_description": [
      {
        "key": "About the job",
        "value": [
          "Coursera was launched in 2012 by two Stanford Computer Science professors, Andrew Ng and Daphne Koller, with a mission to provide universal access to world-class learning. It is now one of the largest online learning platforms in the world, with 148 million registered learners as of March 31, 2024.",
          "Coursera partners with over 325 leading university and industry partners to offer a broad catalog of content and credentials, including courses, Specializations, Professional Certificates, Guided Projects, and bachelor’s and master’s degrees. Institutions around the world use Coursera to upskill and reskill their employees, citizens, and students in fields such as data science, technology, and business. Coursera became a B Corp in February 2021.",
          "Join us in our mission to create a world where anyone, anywhere can transform their life through access to education. We're seeking talented individuals who share our passion and drive to revolutionize the way the world learns.",
          "We at Coursera are committed to building a globally diverse team and are thrilled to extend employment opportunities to individuals in any country where we have a legal entity. We require candidates to possess eligible working rights and have a compatible timezone overlap with their team to facilitate seamless collaboration. As a remote-first company, our interviews and onboarding are entirely virtual, providing a smooth and efficient experience for our candidates."
        ]
      },
      {
        "key": "Job Overview:",
        "value": [
          "Coursera is bootstrapping a new development center, with a focus on building a platform team in India. This is an unique opportunity to be part of the founding team that would not only own a mission-critical charter but also play a significant role in shaping the culture of the location. We are looking for individuals with an entrepreneurial mindset who are excited by the prospect of building impactful 0 to 1 products.",
          "As an engineer on the platform Integrations team, you will be responsible for designing and developing integrations with various Learning Tools, Learning Management Systems (LMS), Learning Experience Platforms (LXP), and Human Resource Information Systems (HRIS) to drive the adoption of Coursera's learning products. You will have the opportunity to work on complex technical challenges, and influence the future roadmap, growth, and success of Coursera's business. You will work closely with a cross-functional team of product, design, QA, solution architects, and peers from data engineering, infrastructure and SRE. You must be comfortable working in a fast-moving team environment (we deploy many times a day!)"
        ]
      },
      {
        "key": "Responsibilities:",
        "value": [
          "Design and implement scalable & robust APIs and Systems",
          "Measure your work thoroughly, analyze results, and generate hypotheses to drive new product changes through A/B testing",
          "Write and review technical documentation for the components owned by your team",
          "Develop and deploy your high-quality code (in Java, Scala or similar languages) following industry best practices and track key service level indicators (SLIs)",
          "Debug and fix production issues, lead blameless retrospectives, and participate in the on-call rotation to ensure adherence to the service level agreements (SLAs)",
          "Collaborate and mentor team members, and contribute to teams' success improving processes"
        ]
      },
      {
        "key": "Basic Qualifications:",
        "value": [
          "2-5 years of experience working in a relevant backend software engineering role",
          "Proficient in implementing APIs and writing automated tests",
          "Expertise in using managed cloud services, streaming technologies and handling large data sets",
          "Prior experience in developing new features and debugging complex issues with minimal supervision",
          "Fervent belief in engineering quality and building technical leverage for others",
          "Data-driven and strongly motivated by success and learnings through experiments and metrics analysis"
        ]
      },
      {
        "key": "Preferred Qualifications: ",
        "value": [
          "Founding engineers or candidates with prior experience in start-up environments are preferred, specifically those who have been part of a bootstrapping team, small start-up team, or expansion team",
          "Demonstrated ability to work in a fast-paced and dynamic environment, and navigate through ambiguity and uncertainty with confidence.",
          "Experience collaborating with cross-functional teams to deliver high-quality products or services",
          "Proven track record of delivering results in a resource-constrained environment with limited guidance and supervision"
        ]
      }
    ],
    "id": 129
  },
  {
    "company_name": "Postman",
    "position": "Software Engineer",
    "req_experience": "Applied AI Engineer",
    "link": "https://wd1.myworkdaysite.com/recruiting/paypal/jobs/job/Chennai-Tamil-Nadu-India/Software-Engineer_R0114595-1",
    "company_logo": "assets/images/postman.gif",
    "skill_vis_check": false,
    "req_skills": "",
    "location": "BLR",
    "status": "open",
    "job_type": "software",
    "job_description": [
      {
        "key": "Join Postman as an Applied AI Engineer :",
        "value": [
          "Are you excited about AI’s potential? Do you want to work toward the goal of using AI to help millions of developers be more effective at their jobs? At Postman, one of our goals is to create net new developers in the world, and we believe products like Postbot, an AI Assistant for our users, will play a vital role in this journey. ",
          "To help us with this, we’re seeking exceptional engineers to join us. As an AI Software Engineer, you will work with a talented team of engineers, researchers, design and Product teams, to design and implement key components on developing and implementing AI-powered products and workflows into Postman’s product."
        ]
      },
      {
        "key": "What You'll Do :",
        "value": [
          "Generative AI is such a new field that best practices and recommendations aren’t fully developed, so we can experiment and learn a lot. That being said, here’s what has worked for us so far:",
          "Use your expertise to help evaluate benchmarks, build new agent architectures, design and manage data pipelines, and run large-scale experiments to ship new features.",
          "Help integrate product and research by developing prototypes and translating them to production.",
          "Stay ahead by engaging with the latest machine learning and AI developments. Take part in code reviews, share knowledge, and lead by example to maintain high-quality engineering practices.",
          "Collaborate with cross-functional teams to deliver product features on time across Postman’s product stack.",
          "Ship with high intent and work with the team to improve your ability to iterate and ship AI-powered features over time."
        ]
      },
      {
        "key": "You might be a good fit if you :",
        "value": [
          "Are a product-minded engineer (2-5 years+) who has the desire and flexibility to wear multiple hats",
          "Have experience shipping AI features or building AI infrastructure",
          "Have knowledge of basic machine learning methods, especially those related to natural language processing and generative models.",
          "Have the ability to design and run ML research experiments, engineer prototypes, and build infrastructure and tooling for processing data.",
          "Have a 'validate first and perfect later' mentality and are curious about how things work inside the hood.",
          "Are self-driven, self-motivated, able to work independently and in a team",
          "Have a background in building and shipping world-class products at scale and have a passion and interest in AI",
          "Have experience with NodeJS or Javascript is a plus"
        ]
      }
    ],
    "id": 126
  },
  {
    "company_name": "inMOBI",
    "position": "SDE I",
    "req_experience": "Backend",
    "link": "https://wd1.myworkdaysite.com/recruiting/paypal/jobs/job/Chennai-Tamil-Nadu-India/Software-Engineer_R0114595-1",
    "company_logo": "assets/images/inmobi.gif",
    "skill_vis_check": false,
    "req_skills": "",
    "location": "Chennai",
    "status": "open",
    "job_type": "software",
    "job_description": [
      {
        "key": "Our Story",
        "value": [
          "Building a new company in the recession of 2007 was no ordinary task. Yet with passion and foresight, we charted our course, helping to transform the way consumers engage with their phones.",
          "Over the last 17 years, InMobi has built a global Advertising Platform that powers our customers’ growth by helping them engage their audiences and drive real connections.",
          "InMobi has also built a second unicorn, Glance, which is advancing digital consumption and creating a new wave of disruption. Present on 400M devices across India, SEA, Japan and the US – Glance is one of the largest content platforms globally with~200M daily active users."
        ]
      },
      {
        "key": "What will you be doing?",
        "value": [
          "Build and maintain tools for deployment, monitoring and operations ",
          "Implement solutions for automation of application build, test, deployment, configuration management, and orchestration ",
          "Implement DevOps pipeline tools in support of vertical team’s needs ",
          "Document DevOps processes, procedures, and environments ",
          "Support Continuous Integration (CI) / Continuous Deployment (CD) and DevOps transformation initiatives under the guidance of the configuration manager/architect. ",
          "Contribute in developing best practices for infrastructure as code (e.g.: Terraform, Shell scripting), software build tools (Maven, Gradle, etc.) and continuous integration tools (Jenkins, Github Actions, etc.).",
          "Work with development and Infrastructure Teams in developing building/packaging/deployment processes for new projects. "
        ]
      },
      {
        "key": "Roles & Responsibilities:",
        "value": [
          "Years of Experience: 1-2 years ",
          "Educational Qualification: B.Tech/MCA. ",
          "Strong coding skills in at least one programing/scripting language",
          "Ability to build custom tools and scripts to automate tasks and improve efficiency.",
          "Strong debugging/troubleshooting skills ",
          "Good communication skills.  "
        ]
      },
      {
        "key": "Your day to day",
        "value": [
          "Work within a team of highly talented engineers, product and architects to design and develop a highly scalable Platforms",
          "Being involved in design meetings to propose, discuss and refine new features and functionality.",
          "Participating and collaborating with Product Owner/ Cross functional teams in the organisation to Understand the business requirements and to deliver solutions that can scale.",
          "Designing and implementing Software that is simple, bug-free, intuitive and easy to use with platform",
          "development mindset to solve privacy platform problems.",
          "Proactively anticipating problems and keeping the team and management informed in a timely manner.",
          "4+ years of experience developing large scale applications JAVA, Spring Core and Spring Batch, with good hands on exposure to SQL and NoSQL technologies, good understanding of relational and free form databases, including strong data architecture and SQL development skills",
          "Experience in NodeJS, React is a plus.",
          "Deep understanding of advanced object-oriented design and development principles.",
          "Good understanding of designing and developing data intensive applications, and architecting them for scalability and availability.",
          "Developing high traffic backend services, with low latency and designing them for scale.",
          "Experience applying software design patterns, data structures, algorithms.",
          "Good analytical and problem solving skills",
          "Experience with unit testing using Junit.",
          "Experience using industry standard software development tools (IDE / Version Control / Continuous Integration)",
          "Strong debugging and problem resolution skills",
          "Expertise in online payments and related domains is a plus",
          "Focuses on test driven development and automation.",
          "Believes in Agile development and are comfortable with SCRUM process.",
          "Refactor existing codebase and in understanding existing implementations to decide to refactor or rewrite.",
          "Work within a team of highly talented engineers, product and architects to design and develop a highly scalable Platforms",
          "Being involved in design meetings to propose, discuss and refine new features and functionality.",
          "Participating and collaborating with Product Owner/ Cross functional teams in the organisation to Understand the business requirements and to deliver solutions that can scale.",
          "Designing and implementing Software that is simple, bug-free, intuitive and easy to use with platform",
          "development mindset to solve privacy platform problems.",
          "Proactively anticipating problems and keeping the team and management informed in a timely manner.",
          "4+ years of experience developing large scale applications JAVA, Spring Core and Spring Batch, with good hands on exposure to SQL and NoSQL technologies, good understanding of relational and free form databases, including strong data architecture and SQL development skills",
          "Experience in NodeJS, React is a plus.",
          "Deep understanding of advanced object-oriented design and development principles.",
          "Good understanding of designing and developing data intensive applications, and architecting them for scalability and availability.",
          "Developing high traffic backend services, with low latency and designing them for scale.",
          "Experience applying software design patterns, data structures, algorithms.",
          "Good analytical and problem solving skills",
          "Experience with unit testing using Junit.",
          "Experience using industry standard software development tools (IDE / Version Control / Continuous Integration)",
          "Strong debugging and problem resolution skills",
          "Expertise in online payments and related domains is a plus",
          "Focuses on test driven development and automation.",
          "Believes in Agile development and are comfortable with SCRUM process.",
          "Refactor existing codebase and in understanding existing implementations to decide to refactor or rewrite."
        ]
      },
      {
        "key": "What do you need to bring",
        "value": [
          "Bachelors / Masters in Computer Science with 4+ years of experience in Software Development.",
          "Strong object-oriented programming skills and Hands on coding in Core Java and J2EE",
          "Experience in Spring framework and RESTful Web Services.",
          "Solid understanding of algorithms and data structures",
          "Experience in Unit testing frameworks such as Junit and TestNG",
          "Well versed with Design Patterns and multi-threaded programming",
          "Thorough knowledge of Version Controls tools like Github and SVN",
          "Familiar with Agile methodologies "
        ]
      }
    ],
    "id": 124
  },
  {
    "company_name": "PayPal",
    "position": "Software Engineer",
    "req_experience": "4+ years",
    "link": "https://wd1.myworkdaysite.com/recruiting/paypal/jobs/job/Chennai-Tamil-Nadu-India/Software-Engineer_R0114595-1",
    "company_logo": "assets/images/paypal.gif",
    "skill_vis_check": false,
    "req_skills": "",
    "location": "Chennai",
    "status": "open",
    "job_type": "software",
    "job_description": [
      {
        "key": "The Company",
        "value": [
          "PayPal has been revolutionizing commerce globally for more than 25 years. Creating innovative experiences that make moving money, selling, and shopping simple, personalized, and secure, PayPal empowers consumers and businesses in approximately 200 markets to join and thrive in the global economy. ",
          "We operate a global, two-sided network at scale that connects hundreds of millions of merchants and consumers. We help merchants and consumers connect, transact, and complete payments, whether they are online or in person. PayPal is more than a connection to third-party payment networks. We provide proprietary payment solutions accepted by merchants that enable the completion of payments on our platform on behalf of our customers.",
          "We offer our customers the flexibility to use their accounts to purchase and receive payments for goods and services, as well as the ability to transfer and withdraw funds. We enable consumers to exchange funds more safely with merchants using a variety of funding sources, which may include a bank account, a PayPal or Venmo account balance, PayPal and Venmo branded credit products, a credit card, a debit card, certain cryptocurrencies, or other stored value products such as gift cards, and eligible credit card rewards.  Our PayPal, Venmo, and Xoom products also make it safer and simpler for friends and family to transfer funds to each other. We offer merchants an end-to-end payments solution that provides authorization and settlement capabilities, as well as instant access to funds and payouts. We also help merchants connect with their customers, process exchanges and returns, and manage risk. We enable consumers to engage in cross-border shopping and merchants to extend their global reach while reducing the complexity and friction involved in enabling cross-border trade. ",
          "Our beliefs are the foundation for how we conduct business every day.  We live each day guided by our core values of Inclusion, Innovation, Collaboration, and Wellness. Together, our values ensure that we work together as one global team with our customers at the center of everything we do – and they push us to ensure we take care of ourselves, each other, and our communities."
        ]
      },
      {
        "key": "Job Description Summary: What you need to know about the role",
        "value": [
          "We’re looking for an experienced Senior Software Engineer to join PayPal Global Financial Risk Investigations (GFCI) team. This is a primarily backend role and you will be sought as an expert of frameworks, advocate for best practices and cross-team influencer. You should be self-motivated, team-oriented, problem solver, possess creative problem-solving skills"
        ]
      },
      {
        "key": "Job Description:",
        "value": [
          "As part of the Compliance Platform Technology organization, this role expects high standards of engineering excellence with strong conceptual understanding in design, develop, test and maintain large scale systems that helps PayPal satisfy the standards/policy requirements of the regulatory agencies in countries that PayPal operates in.",
          "Produce clear, modular, extensible, maintainable and well documented code",
          "Excel in troubleshooting, debugging, and showcase analytical skills",
          "Be Creative and innovative, able to think out of the box Self-starter, Flexible and open-minded",
          "Enjoys fast paced dynamic environment",
          "Excellent Team Player"
        ]
      },
      {
        "key": "Your day to day",
        "value": [
          "Work within a team of highly talented engineers, product and architects to design and develop a highly scalable Platforms",
          "Being involved in design meetings to propose, discuss and refine new features and functionality.",
          "Participating and collaborating with Product Owner/ Cross functional teams in the organisation to Understand the business requirements and to deliver solutions that can scale.",
          "Designing and implementing Software that is simple, bug-free, intuitive and easy to use with platform",
          "development mindset to solve privacy platform problems.",
          "Proactively anticipating problems and keeping the team and management informed in a timely manner.",
          "4+ years of experience developing large scale applications JAVA, Spring Core and Spring Batch, with good hands on exposure to SQL and NoSQL technologies, good understanding of relational and free form databases, including strong data architecture and SQL development skills",
          "Experience in NodeJS, React is a plus.",
          "Deep understanding of advanced object-oriented design and development principles.",
          "Good understanding of designing and developing data intensive applications, and architecting them for scalability and availability.",
          "Developing high traffic backend services, with low latency and designing them for scale.",
          "Experience applying software design patterns, data structures, algorithms.",
          "Good analytical and problem solving skills",
          "Experience with unit testing using Junit.",
          "Experience using industry standard software development tools (IDE / Version Control / Continuous Integration)",
          "Strong debugging and problem resolution skills",
          "Expertise in online payments and related domains is a plus",
          "Focuses on test driven development and automation.",
          "Believes in Agile development and are comfortable with SCRUM process.",
          "Refactor existing codebase and in understanding existing implementations to decide to refactor or rewrite.",
          "Work within a team of highly talented engineers, product and architects to design and develop a highly scalable Platforms",
          "Being involved in design meetings to propose, discuss and refine new features and functionality.",
          "Participating and collaborating with Product Owner/ Cross functional teams in the organisation to Understand the business requirements and to deliver solutions that can scale.",
          "Designing and implementing Software that is simple, bug-free, intuitive and easy to use with platform",
          "development mindset to solve privacy platform problems.",
          "Proactively anticipating problems and keeping the team and management informed in a timely manner.",
          "4+ years of experience developing large scale applications JAVA, Spring Core and Spring Batch, with good hands on exposure to SQL and NoSQL technologies, good understanding of relational and free form databases, including strong data architecture and SQL development skills",
          "Experience in NodeJS, React is a plus.",
          "Deep understanding of advanced object-oriented design and development principles.",
          "Good understanding of designing and developing data intensive applications, and architecting them for scalability and availability.",
          "Developing high traffic backend services, with low latency and designing them for scale.",
          "Experience applying software design patterns, data structures, algorithms.",
          "Good analytical and problem solving skills",
          "Experience with unit testing using Junit.",
          "Experience using industry standard software development tools (IDE / Version Control / Continuous Integration)",
          "Strong debugging and problem resolution skills",
          "Expertise in online payments and related domains is a plus",
          "Focuses on test driven development and automation.",
          "Believes in Agile development and are comfortable with SCRUM process.",
          "Refactor existing codebase and in understanding existing implementations to decide to refactor or rewrite."
        ]
      },
      {
        "key": "What do you need to bring",
        "value": [
          "Bachelors / Masters in Computer Science with 4+ years of experience in Software Development.",
          "Strong object-oriented programming skills and Hands on coding in Core Java and J2EE",
          "Experience in Spring framework and RESTful Web Services.",
          "Solid understanding of algorithms and data structures",
          "Experience in Unit testing frameworks such as Junit and TestNG",
          "Well versed with Design Patterns and multi-threaded programming",
          "Thorough knowledge of Version Controls tools like Github and SVN",
          "Familiar with Agile methodologies "
        ]
      }
    ],
    "id": 124
  },
  {
    "company_name": "Intuit",
    "position": "Senior Software Engineer",
    "req_experience": "Backend",
    "link": "https://www.linkedin.com/jobs/view/3997534403/",
    "company_logo": "assets/images/intuit.gif",
    "skill_vis_check": false,
    "req_skills": "",
    "location": "BLR",
    "status": "open",
    "job_type": "software",
    "job_description": [
      {
        "key": "Responsibilities",
        "value": [
          "Writing clean, high-quality, high-performance, maintainable code",
          "Develop and support software including applications, database integration, interfaces, and new functionality enhancements",
          "Coordinate cross-functionally to insure project meets business objectives and compliance standards",
          "Support test and deployment of new products and features",
          "Participate in code reviews"
        ]
      },
      {
        "key": "Qualifications",
        "value": [
          "At least 5+ years in architecting connected-desktop and/or web applications.",
          "BS/MS in computer science or equivalent work experience.",
          "Strong Object-Oriented Programming concepts.",
          "Should be proficient in Server Side (Java/Linux/J2EE) technologies.",
          "Expertise in Amazon Web Services (AWS) and ability to operate in DevOps model.",
          "Expertise in Spring boot Framework. ",
          "Expertise in architecting or developing features for enterprise scale systems will be added advantage.",
          "Passion in being the technology ambassador and coaching engineering excellence to junior engineers.",
          "Strong understanding of the Software design/architecture/data-backed-decision-making processes."
        ]
      }
    ],
    "id": 120
  },
  {
    "company_name": "JPMC",
    "position": "Software Engineer II",
    "req_experience": "Cloud / AWS, Python",
    "link": "https://jpmc.fa.oraclecloud.com/hcmUI/CandidateExperience/en/sites/CX_1001/job/210545065",
    "company_logo": "assets/images/jpmc.gif",
    "skill_vis_check": false,
    "req_skills": "",
    "location": "BLR",
    "status": "open",
    "job_type": "software",
    "job_description": [
      {
        "key": "Job Description",
        "value": [
          "We have an exciting and rewarding opportunity for you to take your software engineering career to the next level. ",
          "As a Software Engineer II at JPMorgan Chase within the Corporate & Investment Banking business, you will be a key player in an agile team, responsible for designing and delivering reliable, industry-leading technology products in a secure, stable, and scalable manner. Your role will involve implementing critical technology solutions across a range of technical areas within various business functions, all in support of the firm's business objectives."
        ]
      },
      {
        "key": "Job responsibilities:",
        "value": [
          "Executes software solutions, design, development, and technical troubleshooting with ability to think beyond routine or conventional approaches to build solutions or break down technical problems",
          "Creates secure and high-quality production code and maintains algorithms that run synchronously with appropriate systems",
          "Produces architecture and design artifacts for complex applications while being accountable for ensuring design constraints are met by software code development",
          "Gathers, analyzes, synthesizes, and develops visualizations and reporting from large, diverse data sets in service of continuous improvement of software applications and systems",
          "Proactively identifies hidden problems and patterns in data and uses these insights to drive improvements to coding hygiene and system architecture",
          "Contributes to software engineering communities of practice and events that explore new and emerging technologies",
          "Adds to team culture of diversity, equity, inclusion, and respect"
        ]
      },
      {
        "key": "Required qualifications, capabilities, and skills",
        "value": [
          "Formal training or certification on software engineering concepts and 3+ years applied experience",
          "Hands-on practical experience in system design, application development, testing, and operational stability",
          "Proficient in coding in one or more languages",
          "Experience in developing, debugging, and maintaining code in a large corporate environment with one or more modern programming languages and database querying languages",
          "Overall knowledge of the Software Development Life Cycle",
          "Solid understanding of agile methodologies such as CI/CD, Applicant Resiliency, and Security",
          "Demonstrated knowledge of software applications and technical processes within a technical discipline (e.g., cloud, artificial intelligence, machine learning, mobile, etc.)"
        ]
      },
      {
        "key": "Preferred qualifications, capabilities, and skills",
        "value": [
          "Familiarity with modern front-end technologies",
          "Exposure to cloud technologies"
        ]
      }
    ],
    "id": 119
  },
  {
    "company_name": "UST",
    "position": "Python Automation Engineer",
    "req_experience": "0 - 2 YEARS",
    "link": "https://usource.ripplehire.com/candidate/?token=f0T68WHEieVWZl7YTCoR&lang=en&ref=LI01#detail",
    "company_logo": "assets/images/hiring.gif",
    "skill_vis_check": false,
    "req_skills": "",
    "location": "BLR",
    "status": "open",
    "job_type": "software",
    "job_description": [
      {
        "key": "Role description",
        "value": [
          "Associate I - Semiconductor S/W Product Development",
          "At UST, we help the world’s best organizations grow and succeed through transformation. Bringing together the right talent, tools, and ideas, we work with our client to co-create lasting change. Together, with over 26,000 employees in 25 countries, we build for boundless impact—touching billions of lives in the process. Visit us at ."
        ]
      },
      {
        "key": "Opportunity:",
        "value": [
          " You will be part of a team engaged in the validation of BIOS/FW for client PC products.",
          "You will be responsible to work with client engineers to develop and deploy test automation framework and to automate the test cases to validate the features."
        ]
      },
      {
        "key": "Your job responsibilities include but not limited to",
        "value": [
          "Understand the FW features and the test cases to validate them",
          "Automate test cases by programming - Test automation content development based on existing or new test Cases - Identify, verify, and document automation procedure for the product / IP features - Deliver automated scripts to run on Pre silicon , emulation and post silicon platforms . - adding automated test cases for new features/IPs into existing frameworks , emulation/ simulation models.",
          "Integrate test cases with the automation framework and create functional test suite",
          "Conduct reviews with test case owners content team",
          "System level automation execution tasks such as running automated scripts on Simulated models , evaluation environments and on Post silicon platforms",
          "Work closely with Customer team to meet deadlines in test development and execution",
          "Publish daily and weekly status reports"
        ]
      },
      {
        "key": "Essential Skills/Experience:",
        "value": [
          "Bachelor's degree in electrical/ computer engineering",
          "Understanding of system firmware boot flow .",
          "Ability to propose solutions to test automation challenges",
          "Hands on experience in Linux, and UEFI shell command exposure",
          "Good communication and interpersonal skills to work with different teams"
        ]
      },
      {
        "key": "What you need",
        "value": [
          "2+ years of experience in Python programming",
          "Knowledge to develop Python programs to work with registers and do bitwise operation",
          "Good understanding about validation of BIOS/FW/platform of Server/Client platforms",
          "Knowledge of various subsystems and interfaces in a PC Client/ Server system",
          "Ability to understand BIOS/FW/product features and develop test cases to validate them"
        ]
      }
    ],
    "id": 118
  },
  {
    "company_name": "Capgemini",
    "position": "Software Engineer",
    "req_experience": "freshers",
    "link": "https://app.joinsuperset.com/join/#/signup/student/jobprofiles/6e4f8e33-c0a0-4348-83af-66cd8aa8ff9e",
    "company_logo": "assets/images/capgemini.gif",
    "skill_vis_check": false,
    "req_skills": "",
    "location": "Mumbai",
    "status": "open",
    "job_type": "software",
    "job_description": [
      {
        "key": "Job Description",
        "value": [
          "Candidates must have an active DigiLocker account and active mobile number linked with their Aadhar Number while applying for this job",
          "Capgemini is hiring the best technical graduates emerging out of top engineering colleges to join us and become an integral part of our workforce.",
          "As a part of Capgemini Exceller program, you will get to work with diverse teams, cross-functional projects & join a collaborative network of peers and mentors; working together for sustainable solutions for customers.",
          "If being a part of & thriving in the ever-changing landscape of today’s technology world excites you, Capgemini is the place to be."
        ]
      },
      {
        "key": "Key Responsibilities",
        "value": [
          "Contribute to a global business and technology teams responsible for developing and delivering innovative technology offerings and solutions",
          "Designs, develops, modifies and helps in maintaining the basic modules based on functional and system requirements",
          "Good exposure to configuration management, testing, deployment researching and utilizing new and emerging technologies to meet customer requirements",
          "Strong programming skills, as well as the ability to review complex code bases written by others ",
          "Strong architecture and design background and keen business sense"
        ]
      },
      {
        "key": "Desired Competencies",
        "value": [
          "Communication: You should possess strong communication skills for effective interactions with project partners.",
          "Collaboration: You should demonstrate good interpersonal, and collaboration skills",
          "Flexibility: You should be willing to skill-up in multiple technologies and work in any Capgemini city location and travel as required.",
          "Initiative: You should be able to work independently, take initiative and manage a variety of activities concurrently",
          "Other Skills: Good analytical and problem-solving skill"
        ]
      }
    ],
    "id": 117
  },
  {
    "company_name": "Intuit",
    "position": "Software Engineer 2",
    "req_experience": "2+ years",
    "link": "https://www.linkedin.com/jobs/view/3992303527/",
    "company_logo": "assets/images/intuit.gif",
    "skill_vis_check": false,
    "req_skills": "",
    "location": "BLR",
    "status": "open",
    "job_type": "software",
    "job_description": [
      {
        "key": "Overview",
        "value": [
          "QuickBooks is the flagship accounting software from Intuit that fuels millions of small business owners and accountants across multiple countries globally. QuickBooks is truly the operating system behind small business accounting and comes in multiple flavors – QuickBooks Online, QuickBooks Desktop as well as the mobile edition. The Small Business Group provides multiple offerings of QuickBooks features such as Core Accounting, QuickBooks Commerce, Payments, Payroll, Point of Sale (POS). Built on cutting edge technologies by world class engineers based on Global Engineering Principles, the SBG product development team fosters innovation, providing the best in class experience to our small business owners, accountants and through Design for Delight, Rapid Prototyping, Fail Fast and Agile processes."
        ]
      },
      {
        "key": "Responsibilities",
        "value": [
          "Roughly 95% of hands-on coding",
          "Contribute to early quality activities, including peer reviews of estimates, designs, and code",
          "Resolve defects/bugs during QA testing, pre-production, production, and post-release patches",
          "Partner effectively with all team members to deliver against commitments",
          "Work cross-functionally with various Intuit teams: product management, QA/QE,",
          "various product lines, or business units to drive forward results",
          "Commitment to team success and positive team dynamics",
          "Passion for growing and applying technical skills in service to customers",
          "Experience with Agile Development, SCRUM, and/or Extreme Programming",
          "methodologies",
          "The result-oriented mindset with an affinity for producing high-quality code",
          "Have a customer-focused mindset"
        ]
      },
      {
        "key": "Qualifications",
        "value": [
          "BS/MS in computer science or equivalent work experience",
          "2+ years working as a software engineer, ideally using Agile/Scrum and developing customer facing web applications",
          "Solid grasp of software engineering fundamentals and their practical application",
          "An understanding of the Software Development Life Cycle (SDLC)",
          "Experience with any of the following Object-Oriented Languages (OOD): Java/J2EE.",
          "Strong working knowledge of API development standards like REST/GraphQL protocol, pagination, throttling, caching and routing mechanisms experience is strongly preferred.",
          "Proven ability to balance work on multiple projects in parallel.",
          "Ability to learn quickly, pivot, visualize and own a feature end-to-end.",
          "Strong end to end testing mindset, and working knowledge of Front-End and Back-End testing techniques.",
          "Experience working with three or more of: Cloud platforms development e.g. AWS/Kubernetes/Container platforms based development",
          "Experience with Postgres, Data Lake, Kafka, & schema modeling will be a plus.",
          "Solid foundation in writing scalable web application code following best practices of accessibility, internationalization and instrumentation.",
          "Good understanding of Software Design, Architecture and working with large scale systems.",
          "An understanding of unit testing & Test-Driven Development (TDD)",
          "'Self-starter' attitude and ability to make decisions independently",
          "Helpful, can-do attitude and a willingness to take ownership of problems",
          "Solid communication skills"
        ]
      }
    ],
    "id": 113
  },
  {
    "company_name": "PhonePe",
    "position": "Software Engineer",
    "req_experience": "3+ years",
    "link": "https://boards.greenhouse.io/embed/job_app?token=6073078003&gh_src=961e65dc3us?source=careercurvv",
    "company_logo": "assets/images/phonepe.gif",
    "skill_vis_check": false,
    "req_skills": "",
    "location": "BLR",
    "status": "open",
    "job_type": "software",
    "job_description": [
      {
        "key": "About PhonePe Group: ",
        "value": [
          "PhonePe is India’s leading digital payments company with 50 crore (500 Million) registered users and 3.7 crore (37 Million) merchants covering over 99% of the postal codes across India. On the back of its leadership in digital payments, PhonePe has expanded into financial services (Insurance, Mutual Funds, Stock Broking, and Lending) as well as adjacent tech-enabled businesses such as Pincode for hyperlocal shopping and Indus App Store which is India's first localized App Store. The PhonePe Group is a portfolio of businesses aligned with the company's vision to offer every Indian an equal opportunity to accelerate their progress by unlocking the flow of money and access to services."
        ]
      },
      {
        "key": "Challenges",
        "value": [
          "Building for Scale, Rapid Iterative Development, and Customer-centric Product Thinking at each step defines every day for a developer at PhonePe. Though we engineer for a 50million+ strong user base, we code with every individual user in mind. While we are quick to adopt the latest in Engineering, we care utmost for security, stability, and automation. Apply if you want to experience the best combination of passionate application development and product-driven thinking"
        ]
      },
      {
        "key": "Responsibilities",
        "value": [
          "You will build Robust and scalable web-based applications You will need to think of platforms & reuse",
          "Build abstractions and contracts with separation of concerns for a larger scope",
          "Drive problem-solving skills for high-level business and technical problems.",
          "Do high-level design with guidance; Functional modeling, break-down of a module",
          "Do incremental changes to architecture: impact analysis of the same",
          "Do performance tuning and improvements in large scale distributed systems",
          "Mentor young minds and foster team spirit, break down execution into phases to bring predictability to overall execution",
          "Work closely with Product Manager to derive capability view from features/solutions, Lead execution of medium-sized projects",
          "Work with broader stakeholders to track the impact of projects/features and proactively iterate to improve them As a senior software engineer you must have",
          "Extensive and expert programming experience in at least one general programming language (e.g. Java, C, C++) & tech stack to write maintainable, scalable, unit-tested code.",
          "Experience with multi-threading and concurrency programming",
          "Extensive experience in object-oriented design skills, knowledge of design patterns, and huge passion and ability to design intuitive module and class-level interfaces",
          "Excellent coding skills – should be able to convert the design into code fluently",
          "Knowledge of Test Driven Development",
          "Good understanding of databases (e.g. MySQL) and NoSQL (e.g. HBase, Elasticsearch, Aerospike, etc)",
          "Strong desire to solving complex and interesting real-world problems",
          "Experience with full life cycle development in any programming language on a Linux platform",
          "Go-getter attitude that reflects in energy and intent behind assigned tasks",
          "Worked in a startups environment with high levels of ownership and commitment",
          "BTech, MTech, or Ph.D. in Computer Science or related technical discipline (or equivalent).",
          "Experience in building highly scalable business applications, which involve implementing large complex business flows and dealing with a huge amount of data.",
          "3-5 years of experience in the art of writing code and solving problems on a Large Scale.",
          "An open communicator who shares thoughts and opinions frequently listens intently and takes constructive feedback.",
          "As a Software Engineer, good to have",
          "The ability to drive the design and architecture of multiple subsystems",
          "Ability to break-down larger/fuzzier problems into smaller ones in the scope of the product",
          "Understanding of the industry’s coding standards and an ability to create appropriate technical documentation."
        ]
      }
    ],
    "id": 113
  },
  {
    "company_name": "Cricbuzz.com",
    "position": "Full Stack Engineer ",
    "req_experience": "1-2 years ",
    "link": "https://www.linkedin.com/jobs/view/3978712961",
    "company_logo": "assets/images/cricbuzz.gif",
    "skill_vis_check": false,
    "req_skills": "",
    "location": "",
    "status": "open",
    "job_type": "software",
    "job_description": [
      {
        "key": "Job Title",
        "value": [
          "Full Stack Developer"
        ]
      },
      {
        "key": "Overview",
        "value": [
          "We are seeking a talented Full Stack Developer with 1-2 years of experience in Node.js to join our dynamic team. In this role, you will be responsible for developing and implementing scalable backend services and user-facing features across our web applications."
        ]
      },
      {
        "key": "Responsibilities",
        "value": [
          "Design and implement robust backend solutions using Node.js and related frameworks (Express, etc.).",
          "Develop frontend components using modern JavaScript frameworks (React, Angular, etc.).",
          "Write clean and maintainable code.",
          "Implement security and data protection measures.",
          "Build reusable code and libraries for future use.",
          "Stay updated on emerging technologies and industry trends."
        ]
      },
      {
        "key": "Requirements",
        "value": [
          "Bachelor’s degree in Computer Science, Engineering, or a related field, or equivalent practical experience.",
          "Proven experience (1-2 years) as a Full Stack Developer with expertise in Node.js.",
          "Solid understanding of front-end technologies, such as JavaScript, HTML5, and CSS3.",
          "Experience with front-end frameworks/libraries like React, Angular, Vue.js, etc.",
          "Familiarity with relational and NoSQL databases (MySQL, MongoDB, etc.).",
          "Knowledge of RESTful API design and development.",
          "Understanding of asynchronous programming and its quirks and workarounds.",
          "Experience with version control systems (Git, SVN, etc.).",
          "Knowledge of CI/CD pipelines and DevOps practices.",
          "Excellent problem-solving skills and attention to detail.",
          "Strong communication and collaboration skills."
        ]
      }
    ],
    "id": 112
  },
  {
    "company_name": "VISA",
    "position": "Software Engineer",
    "req_experience": "2+ years",
    "link": "https://jobs.smartrecruiters.com/Visa/744000003886545-software-engineer?source=careercurvv",
    "company_logo": "assets/images/visa.gif",
    "skill_vis_check": false,
    "req_skills": "",
    "location": "BLR",
    "status": "open",
    "job_type": "software",
    "job_description": [
      {
        "key": "Job Description",
        "value": [
          "We at Visa, dream of a future where it's easy to pay and be paid. Across the planet. Where ever. Whenever. Securely. Easily. Together, we are building leading edge full-service Payment Management solutions combining global payment processing, fraud management and payment security systems. We are looking for a talented SW Engineer to join our team!",
          "The Software Engineer will play a pivotal role in Risk and Identity Solutions (VAS) department. In this mission critical role, it's an opportunity to design and implement solutions and taking it to the production with high quality completing all phases, following an agile methodology. The responsibilities also include gathering and clarifying requirements, facilitating communication with other groups within the organization, and guiding architectural decisions. It is an opportunity to learn, lead and work on technologies for RAIS applications."
        ]
      },
      {
        "key": "Responsibilities",
        "value": [
          "Design, implement and evolve highly scalable and fault-tolerant distributed components using functional programming paradigm",
          "Participate in business requirements review and build functional & technical design documentation",
          "Design and implement testing procedures for: APIs, abstractions and integration patterns to solve challenging distributed computing problems covering end to end tests and integration scenarios.",
          "Participate in design reviews to provide input on functional/non-functional requirements, product designs, schedules, or potential problems.",
          "Work across the team to ensure the team is predictable, productive, and delivering high quality.",
          "Review code and accountability for team's development/testing activities",
          "Participate in proof of concepts and other technical evaluations of new technologies"
        ]
      },
      {
        "key": "Qualifications",
        "value": [
          "Basic Qualifications:",
          "Bachelor's degree, OR 3+ years of relevant work experience",
          "Preferred Qualifications:",
          "2 or more years of work experience",
          "0-1 years of work experience in technology industry with coding and testing skills.",
          "Strong technical competency and experience with web applications, web services, Java, JavaScript, J2EE, XML, unit-testing, shell-scripting and RDBMS is a plus.",
          "Experience with Cassandra/solr/nosql experience as a plus.",
          "Continuous Integration, Code/Test coverage working in different methodologies is a plus.",
          "Must have proactive and strong communications to work well across teams."
        ]
      }
    ],
    "id": 110
  },
  {
    "company_name": "Nykaa",
    "position": "Machine Learning Engineer",
    "req_experience": "3+ years",
    "link": "https://www.linkedin.com/jobs/view/3986102156/",
    "company_logo": "assets/images/nykaa.gif",
    "skill_vis_check": false,
    "req_skills": "",
    "location": "BLR",
    "status": "open",
    "job_type": "software",
    "job_description": [
      {
        "key": "What You Will Do:",
        "value": [
          "Build, and contribute to ML platforms like feature stores, ML deployment infrastructure",
          "Bring industry best practices of MLOps and continuously improve the MLOps pipeline to be the best.",
          "Automating machine learning deployment",
          "Building systems for monitoring all components of ML pipelines",
          "Identifying and creating modules to implement ML components which are common to multiple ML pipelines",
          "Implementation of MLOps framework and governance.",
          "Actively contribute in peer code reviews and ensure best practices are followed in ML development"
        ]
      },
      {
        "key": "Skills",
        "value": [
          "Minimum 3 years of relevant experience",
          "Have a sound understanding of data modeling pipelines, optimization techniques, and prevalent ML architectures (Databricks, Airflow and MLFlow).",
          "Experience with frameworks such as TensorFlow, Keras, PyTorch, and Scikit-Learn",
          "Solid understanding of cloud platforms (AWS, GCP, AZURE) and experience in deploying the models in cloud architectures.",
          "Knowledge of software testing, deployment and maintenance",
          "Work closely with cross-functional teams to design, deploy, and improve scalable machine learning models",
          "Experience on Search, Ranking, Relevance, Recommendations is highly preferred",
          "Knowledge of PySpark and visualization tools like Grafana",
          "Moderate background in machine learning and deep learning"
        ]
      }
    ],
    "id": 109
  },
  {
    "company_name": "JPMorgan Chase",
    "position": "Software Engineer II ",
    "req_experience": "LLM",
    "link": "https://jpmc.fa.oraclecloud.com/hcmUI/CandidateExperience/en/sites/CX_1001/job/210536312",
    "company_logo": "assets/images/jpmc.gif",
    "skill_vis_check": false,
    "req_skills": "",
    "location": "BLR",
    "status": "open",
    "job_type": "software",
    "job_description": [
      {
        "key": "JOB DESCRIPTION",
        "value": [
          "You’re ready to gain the skills and experience needed to grow within your role and advance your career — and we have the perfect software engineering opportunity for you.",
          "As a Software Engineer II at JPMorgan Chase within the Asset & Wealth Management, you are part of an agile team that works to enhance, design, and deliver the software components of the firm’s state-of-the-art technology products in a secure, stable, and scalable way. As an emerging member of a software engineering team, you execute software solutions through the design, development, and technical troubleshooting of multiple components within a technical product, application, or system, while gaining the skills and experience needed to grow within your role."
        ]
      },
      {
        "key": "Job responsibilities",
        "value": [
          "Executes standard software solutions, design, development, and technical troubleshooting",
          "Writes secure and high-quality code using the syntax of at least one programming language with limited guidance",
          "Designs, develops, codes, and troubleshoots with consideration of upstream and downstream systems and technical implications",
          "Applies knowledge of tools within the Software Development Life Cycle toolchain to improve the value realized by automation",
          "Applies technical troubleshooting to break down solutions and solve technical problems of basic complexity",
          "Gathers, analyzes, and draws conclusions from large, diverse data sets to identify problems and contribute to decision-making in service of secure, stable application development",
          "Learns and applies system processes, methodologies, and skills for the development of secure, stable code and systems",
          "Adds to team culture of diversity, equity, inclusion, and respect"
        ]
      },
      {
        "key": "Required qualifications, capabilities, and skills",
        "value": [
          "Formal training or certification on software engineering concepts and 2+ years applied experience",
          "Experience in application, data and infrastructure architecture disciplines  ",
          "Experience in Java development",
          "Experience in Python development",
          "Experience in web application frameworks like React, Angular, React. ",
          "Experience or Exposure to Large Language Models (LLM)/GenAI technology like OpenAI API, (GPT models), HuggingFace models etc. with understanding of Transformers architecture.",
          "Experience in cloud",
          "Experience of continuous delivery and DevOps tooling"
        ]
      }
    ],
    "id": 108
  },
  {
    "company_name": "Meesho",
    "position": "Software Development Engineer I",
    "req_experience": "Entry Level",
    "link": "https://www.meesho.io/jobs/software-development-engineer-i-data?id=fdbc2008-63d6-4334-8d9b-0dfa94ce4256",
    "company_logo": "assets/images/meesho.gif",
    "skill_vis_check": false,
    "req_skills": "",
    "location": "Bangalore, Karnataka",
    "status": "open",
    "job_type": "software",
    "job_description": [
      {
        "key": "Location",
        "value": [
          "Bangalore, Karnataka | Tech"
        ]
      },
      {
        "key": "Application",
        "value": [
          "APPLY NOW"
        ]
      },
      {
        "key": "About the Team",
        "value": [
          "We want our users to have a next-level experience on our platform. With the right minds working on our Backend, we can do that - and more! When 5% of Indian households shop with us, it’s important to build resilient systems to manage millions of orders every day. We’ve done this – with zero downtime! Sounds impossible? Well, that’s the kind of Engineering muscle that has helped Meesho become the e-commerce giant that it is today. We value speed over perfection and see failures as opportunities to become better. We’ve taken steps to inculcate a strong ‘Founder’s Mindset’ across our engineering teams, making us grow and move fast.",
          "We place special emphasis on the continuous growth of each team member - and we do this with regular 1-1s and open communication. As Software Development Engineer - I (SDE- I) - Data, you will be part of self-starters who thrive on teamwork and constructive feedback. Perhaps, that’s why our Data Engineering team attracts the best talents across the country like the 💍 attracts Gollum. We know how to party as hard as we work! If we aren’t building unparalleled tech solutions, you can find us debating the plot points of our favorite books and games – or even gossiping over chai. So, if a day filled with building impactful solutions with a fun team sounds appealing to you, join us."
        ]
      },
      {
        "key": "About the Role",
        "value": [
          "We are looking for an experienced Software Development Engineer - I (Data), who will create prototypes and proofs-of-concept for iterative development in Java. Additionally, in this role, you will be responsible for converting design into code fluently.",
          "The cherry on top? You’ll be part of a team that will help you upskill and grow in your career. Safe to say, an exciting and rewarding journey awaits you in this role."
        ]
      },
      {
        "key": "What you will do",
        "value": [
          "Convert design to code seamlessly",
          "Develop proofs-of-concept and prototypes for development in Java, Python",
          "Hands-on In Spark, Scala/Pyspark.",
          "Hands-on working on cloud platform",
          "Good knowledge in Data-lake",
          "Develop long-term strategies for newbie engineers that work in favor of the organization",
          "Resolve bugs on time and make edits according to the feedback",
          "Stay updated with emerging tech cultures and identify the right opportunities to implement them",
          "Ensure content quality and consistency of the brand"
        ]
      },
      {
        "key": "What you will need",
        "value": [
          "B.Tech, preferably from premier institutions",
          "Excellent coding skills - should be able to convert design into code fluently",
          "Ability to create prototypes and proofs of concept for iterative development in Java / Python",
          "Good understanding of data structures and algorithms and their space and time complexities",
          "Strong hands-on and practical working experience with Java / Python",
          "Strong problem-solving skills"
        ]
      },
      {
        "key": "About Us",
        "value": [
          "Welcome to Meesho, where every story begins with a spark of inspiration and a dash of entrepreneurial spirit. We're not just a platform; we're your partner in turning dreams into realities.",
          "Our Mission: Democratising internet commerce for everyone- Meesho (Meri shop) started with a single idea in mind -to be an e-commerce destination for the next billion Indian consumers and enable 100 million small businesses to succeed online. We provide sellers with a range of industry-first benefits such as zero commission and the lowest shipping cost. Over 1.75 million sellers are registered on Meesho, growing their business by tapping the company’s massive customer base, state-of-the-art tech infrastructure, pan-India logistics at the lowest cost through third-party logistics providers in an 'Everyday Lowest Cost' channel for sellers. Affordable, relatable merchandise mirroring local markets has helped us make inroads with first-time internet users in the country. We cater to an underserved and unique customer base and cover every serviceable pincode in the country. Our unique business model and continuous innovation has enabled us to become the first Indian horizontal E-commerce company."
        ]
      },
      {
        "key": "Culture and Total Rewards",
        "value": [
          "Our focus is on cultivating a dynamic workplace characterized by high impact and performance excellence. We prioritize a people-centric culture, dedicated to hiring and developing exceptional talent. Total rewards at Meesho comprises of a comprehensive set of elements - monetary, non-monetary, tangible and intangible in nature. Our 11 guiding principles, or 'Mantras,' are the backbone of how we operate - influencing everything from recognition and evaluation to growth discussions. Daily rituals & processes like 'Reflections', 'Listen or Die', Internal Mobility Program, Talent Reviews, Continuous Performance Management - all embody these principles.",
          "We provide market-leading compensation - both cash and equity-based - specific to job roles, individual experience and skill along with our employee-centric benefits and work environment. We focus extensively on holistic wellness - through our MeeCare Program - encompassing benefits and policies across physical, mental, financial, and social wellness aspects. This includes extensive medical insurance benefits for employees and their families, wellness initiatives like telehealth, wellness events, and gym & recreational discounts etc. To support work-life balance, we provide generous leave policies, parental support benefits, retirement benefits, and learning and development assistance. Through gratitude for stretched work, personalized gifts, engagement & fun at work - we promote employee delight at the workplace. Many other benefits such as salary advance support, relocation assistance, and flexible benefits plans further enrich the Meesho employee experience."
        ]
      }
    ],
    "id": 107
  },
  {
    "company_name": "Zeta",
    "position": "Software Development Engineer",
    "req_experience": "1+ years",
    "link": "https://jobs.lever.co/zeta/8c8b68fc-cda5-4625-999f-e52773a8e76b",
    "company_logo": "assets/images/zeta.gif",
    "skill_vis_check": false,
    "req_skills": "",
    "location": "Mumbai",
    "status": "open",
    "job_type": "software",
    "job_description": [
      {
        "key": "About Zeta",
        "value": [
          "Zeta is a Next-Gen Banking Tech company that empowers banks and fintechs to launch banking products for the future.",
          "It was founded by Bhavin Turakhia and Ramki Gaddipati in 2015.",
          "Our flagship processing platform - Zeta Tachyon - is the industry’s first modern, cloud-native, and fully API-enabled stack that brings together issuance, processing, lending, core banking, fraud & risk, and many more capabilities as a single-vendor stack.",
          "20M+ cards have been issued on our platform globally.",
          "Zeta is actively working with the largest Banks and Fintechs in multiple global markets transforming customer experience for multi-million card portfolios.",
          "Zeta has over 1700+ employees - with over 70% roles in R&D - across locations in the US, EMEA, and Asia.",
          "We raised $280 million at a $1.5 billion valuation from Softbank, Mastercard, and other investors in 2021."
        ]
      },
      {
        "key": "Learn More",
        "value": [
          "www.zeta.tech",
          "careers.zeta.tech",
          "Linkedin",
          "Twitter"
        ]
      },
      {
        "key": "The Role",
        "value": [
          "We build large-scale transaction processing systems that can work with many current and future payment networks.",
          "We build applications that help banks realize the value of this new approach early.",
          "We help banks to rapidly deliver the value of these applications to their customers."
        ]
      },
      {
        "key": "What would you do here?",
        "value": [
          "Building highly-scalable and secure payments platform.",
          "Working with various product teams gathering requirements and adding capabilities.",
          "Using cutting-edge cryptography to secure payments beyond industry standards.",
          "Deriving actionable insights by mining TBs of data.",
          "Building low-level infrastructure that aims to push the boundaries of network performance.",
          "Identify patterns and provide solutions to a class of problems.",
          "Research, evaluate, and socialize new tools, technologies, and techniques to improve the value of the system."
        ]
      },
      {
        "key": "What are we looking for?",
        "value": [
          "Bachelor’s/Master’s degree in engineering with 1+ years of experience building enterprise systems.",
          "Worked on one or more large-scale Java applications.",
          "Good understanding of nuances of distributed systems, scalability, and availability.",
          "Good knowledge of one or more relational and NoSQL databases and transactions.",
          "Shrewd focus on latency and throughput of services.",
          "In-depth understanding of concurrency, synchronization, NIO, memory allocation, and GC.",
          "Experience with IaaS clouds like AWS/Google Cloud, Azure, OpenStack, etc.",
          "Experience in working with Message Brokers and Application Containers."
        ]
      },
      {
        "key": "Life At Zeta",
        "value": [
          "At Zeta, we want you to grow to be the best version of yourself by unlocking the great potential that lies within you.",
          "This is why our core philosophy is ‘People Must Grow.’",
          "We recognize your aspirations; act as enablers by bringing you the right opportunities, and let you grow as you chase disruptive goals.",
          "#LifeAtZeta is adventurous and exhilarating at the same time.",
          "You get to work with some of the best minds in the industry and experience a culture that values the diversity of thoughts.",
          "If you want to push boundaries, learn continuously and grow to be the best version of yourself, Zeta is the place to be! Explore the life at Zeta."
        ]
      },
      {
        "key": "Equal Opportunity Employer",
        "value": [
          "Zeta is an equal opportunity employer.",
          "We are committed to equal employment opportunities regardless of job history, disability, gender identity, religion, race, marital/parental status, or another special status.",
          "We are proud to be an equitable workplace that welcomes individuals from all walks of life if they fit the roles and responsibilities."
        ]
      }
    ],
    "id": 105
  },
  {
    "company_name": "Accenture",
    "position": "Software Development Engineer",
    "req_experience": "Entry Level",
    "link": "https://www.accenture.com/in-en/careers/jobdetails?src=LINKEDINJP&id=ATCI-R1-S1753497_en",
    "company_logo": "assets/images/accenture.gif",
    "skill_vis_check": false,
    "req_skills": "",
    "location": "Chennai",
    "status": "open",
    "job_type": "software",
    "job_description": [
      {
        "key": "Project Role",
        "value": [
          "Software Development Engineer"
        ]
      },
      {
        "key": "Project Role Description",
        "value": [
          "Analyze, design, code and test multiple components of application code across one or more clients.",
          "Perform maintenance, enhancements, and/or development work."
        ]
      },
      {
        "key": "Must Have Skills",
        "value": [
          "Autosys Administration"
        ]
      },
      {
        "key": "Good to Have Skills",
        "value": [
          "NA"
        ]
      },
      {
        "key": "Educational Qualification",
        "value": [
          "Graduate"
        ]
      },
      {
        "key": "Key Responsibilities",
        "value": [
          "As an Application Developer, you will design, build, and configure applications to meet business process and application requirements.",
          "You will be responsible for ensuring that the applications are developed according to specifications and delivered on time.",
          "Your typical day will involve collaborating with the team to understand the requirements, designing and coding applications, and testing and debugging the code.",
          "You will also be involved in troubleshooting and resolving any issues."
        ]
      },
      {
        "key": "Technical Experience",
        "value": [
          "Professional and Technical Skills",
          "Proficiency in Incident Management",
          "Strong understanding of software development principles and methodologies"
        ]
      },
      {
        "key": "Professional Attributes",
        "value": [
          "Professional and Technical Skills",
          "Proficiency in Incident Management",
          "Strong understanding of software development principles and methodologies"
        ]
      }
    ],
    "id": 104
  },
  {
    "company_name": "American Express",
    "position": "Software Development Engineer I",
    "req_experience": "1+ Year",
    "link": "https://travelhrportal.wd1.myworkdayjobs.com/Jobs/job/Gurgaon-India/Software-Development-Engineer-I_J-68957-1?rx_campaign=Linkedin1&rx_ch=connector&rx_group=384094&rx_job=J-68957&rx_medium=post&rx_r=none&rx_source=Linkedin&rx_ts=20240724T005003Z&rx_vp=slots&source=Recruitics_LinkedIn_JobSlots&source=LinkedIn&rx_viewer=12bd32b7c91811eca1291f557beae5ef1d5cdcf0c6234cddb64f8d6b8760a1a2",
    "company_logo": "assets/images/american express.gif",
    "skill_vis_check": false,
    "req_skills": "",
    "location": "Gurgaon, India",
    "status": "open",
    "job_type": "software",
    "job_description": [
      {
        "key": "Company",
        "value": [
          "Amex GBT"
        ]
      },
      {
        "key": "Introduction",
        "value": [
          "Amex GBT is a place where colleagues find inspiration in travel as a force for good and – through their work – can make an impact on our industry.",
          "We’re here to help our colleagues achieve success and offer an inclusive and collaborative culture where your voice is valued."
        ]
      },
      {
        "key": "Invitation",
        "value": [
          "Ready to explore a career path? Start your journey."
        ]
      },
      {
        "key": "Typical Day Responsibilities",
        "value": [
          "You have around 1 year of experience in software development and troubleshooting.",
          "Contribute to new features from inception to production, working across the company with product managers, UX designers, and other teams in an agile environment.",
          "Deliver tested and optimized high-performance code.",
          "Analyze customers’ feedback and identify opportunities for enhancing the customer's experience.",
          "Contribute to the production duties for the services owned by your team: Monitoring, Release Management, On Call.",
          "Contribute to our inner-source culture (Internal Open Source) by delivering high quality code that levels up not only your team but the entire organization.",
          "Opportunity to showcase your work on our tech blog and internal & external conferences."
        ]
      },
      {
        "key": "What We’re Looking For",
        "value": [
          "You are convinced that testing is coding.",
          "You can drive the technical implementation of projects at various scales, from small to larger projects spanning over several months.",
          "You are passionate about reviewing your work and others.",
          "You want to define and improve microservice systems in production that are used daily by real customers.",
          "You have learned that you build better software in a team that practices agile methodologies.",
          "You enjoy dealing with complexity in a dynamic and multi-cultural environment.",
          "You embrace the DevOps approach as you believe development teams should be responsible for deploying and monitoring their applications with tools such as Kibana, Datadog, GitHub, etc.",
          "You cannot work without a good CI/CD pipeline based on Maven, Jenkins, Cucumber, Selenium, JUnit, Wiremock, Mockito, and Git."
        ]
      },
      {
        "key": "Technologies Used",
        "value": [
          "Java, Amazon Web Services, Spring Boot, Kotlin, React.js, REST, Cucumber, Selenium, Docker, Kubernetes, Git, Jenkins, Kibana, Datadog, Splunk"
        ]
      },
      {
        "key": "Location",
        "value": [
          "Gurgaon, India"
        ]
      },
      {
        "key": "The #TeamGBT Experience",
        "value": [
          "Work and life: Find your happy medium at Amex GBT.",
          "Flexible benefits are tailored to each country and start the day you do. These include health and welfare insurance plans, retirement programs, parental leave, adoption assistance, and more.",
          "Travel perks: get a choice of deals each week from major travel providers on everything from flights to hotels to cruises and car rentals.",
          "Develop the skills you want when the time is right for you, with global tuition assistance, access to over 20,000 courses on our learning platform, leadership courses, and new job openings available to internal candidates first.",
          "We strive to champion Diversity, Equity, and Inclusion in every aspect of our business at GBT. You can connect with colleagues through our global Inclusion Groups, centered around common identities or initiatives, to discuss challenges, obstacles, achievements, and drive company awareness and action.",
          "Wellbeing resources to support mental and emotional health for you and your immediate family.",
          "And much more!"
        ]
      },
      {
        "key": "About the Company",
        "value": [
          "This role is for Egencia LLC ('Egencia' or the 'Company'), a member of the American Express Global Business Travel family of companies."
        ]
      },
      {
        "key": "Equal Opportunity Statement",
        "value": [
          "All applicants will receive equal consideration for employment without regard to age, sex, gender (and characteristics related to sex and gender), pregnancy (and related medical conditions), race, color, citizenship, religion, disability, or any other class or characteristic protected by law.",
          "We are committed to providing reasonable accommodation to qualified individuals with disabilities. Please let your recruiter know if you need an accommodation at any point during the hiring process."
        ]
      },
      {
        "key": "Encouragement for Applicants",
        "value": [
          "What if I don’t meet every requirement? If you’re passionate about our mission and believe you’d be a phenomenal addition to our team, don’t worry about 'checking every box;' please apply anyway. You may be exactly the person we’re looking for!"
        ]
      }
    ],
    "id": 103
  },
  {
    "company_name": "TCS",
    "position": "NQT",
    "req_experience": "NATIONAL QUALIFIER TEST",
    "link": "https://www.tcsion.com/hub/national-qualifier-test/",
    "company_logo": "assets/images/tcs.gif",
    "skill_vis_check": false,
    "req_skills": "",
    "location": "india",
    "status": "open",
    "job_type": "software",
    "job_description": [
      {
        "key": "TCS iON NQT - Your Gateway to Thousands of Top Jobs",
        "value": [
          "TCS iON National Qualifier Test (TCS iON NQT) helps you prove your skills to top corporates. You may choose to get tested on aptitude skills, domain specific skills or work values. The tests are scheduled every 2-4 weeks in our exam centres. Your TCS iON NQT Scorecard will showcase your performance in every section of the test. You can apply for jobs in various Corporates that accept TCS iON NQT Score from our website and respective Corporates' websites."
        ]
      },
      {
        "key": "Who can Apply",
        "value": [
          "Pre-final or final year students of any stream or degree",
          "Students passing between 2019-2025, who are looking for a job",
          "Working professionals with up to 2 years of experience"
        ]
      }
    ],
    "id": 10
  },
  {
    "company_name": "Infosys",
    "position": "Python Machine learning Engineer",
    "req_experience": "3-5 Years",
    "link": "https://career.infosys.com/jobdesc?sourceId=4003&jobReferenceCode=INFSYS-EXTERNAL-185306",
    "company_logo": "assets/images/infosys.gif",
    "skill_vis_check": false,
    "req_skills": "",
    "location": "BLR",
    "status": "open",
    "job_type": "software",
    "job_description": [
      {
        "key": "Responsibilities",
        "value": [
          " Responsible for successful delivery of MLOps solutions and services in client consulting environments;  ",
          "Define key business problems to be solved; formulate high level solution approaches and identify data to solve those problems, develop, analyze/draw conclusions and present to client. ",
          "Assist clients with operationalization metrics to track performance of ML Models ",
          "Agile trained to manage team effort and track through JIRA ",
          "High Impact Communication- Assesses the target audience need, prepares and practices a logical flow, answers audience questions appropriately and sticks to timeline."
        ]
      },
      {
        "key": "Technical and Professional Requirements:",
        "value": [
          "Technical knowledge- has expertise in cloud technologies, specifically MS Azure, and services with hands on coding to – ",
          "Python Programming - Expert and Experienced - 4 -5 years ",
          "DevOps Working knowledge with implementation experience - 1 or 2 projects a minimum ",
          "Hands-On MS Azure Cloud knowledge ",
          "Understand and take requirements on Operationalization of ML Models from Data Scientist ",
          "Help team with ML Pipelines from creation to execution ",
          "List Azure services required for deployment, Azure Data bricks and Azure DevOps Setup ",
          "Assist team to coding standards (flake8 etc) ",
          "Guide team to debug on issues with pipeline failures ",
          "Engage with Business / Stakeholders with status update on progress of development and issue fix ",
          "Automation, Technology and Process Improvement for the deployed projects ",
          "Setup Standards related to Coding, Pipelines and Documentation ",
          "Adhere to KPI / SLA for Pipeline Run, Execution ",
          "Research on new topics, services and enhancements in Cloud Technologies "
        ]
      },
      {
        "key": "Additional Responsibilities:",
        "value": [
          "Master’s degree in Computer Science Engineering, with Relevant experience in the field of MLOps / Cloud ",
          "Domain experience in Capital Markets, Banking, Risk and Compliance etc. ",
          "Exposure to US/ overseas markets is preferred ",
          "Azure Certified – DP100, AZ/AI900 ",
          "Domain / Technical / Tools Knowledge: ",
          "Object oriented programming, coding standards, architecture & design patterns, Config management, Package Management, Logging, documentation ",
          "Experience in Test Driven Development and experience in using Pytest frameworks, git version control, Rest APIs ",
          "Azure ML best practices in environment management, run time configurations (Azure ML & Databricks clusters), alerts. ",
          "Experience designing and implementing ML Systems & pipelines, MLOps practices ",
          "Exposure to event driven orchestration, Online Model deployment ",
          "Contribute towards establishing best practices in MLOps Systems development ",
          "Proficiency with data analysis tools (e.g., SQL, R & Python) ",
          "High level understanding of database concepts/reporting & Data Science concepts  ",
          "Hands on experience in working with client IT/Business teams in gathering business requirement and converting into requirement for development team ",
          "Experience in managing client relationship and developing business cases for opportunities ",
          "Azure AZ-900 Certification with Azure Architecture understanding is a plus "
        ]
      }
    ],
    "id": 102
  },
  {
    "company_name": "Deloitte",
    "position": "Deputy Managery",
    "req_experience": "-",
    "link": "https://jobsindia.deloitte.com/job/Delhi-Enabling-Areas-Application-Support-Qualtrics-Information-Technology/20244744/",
    "company_logo": "assets/images/deloitte.gif",
    "skill_vis_check": false,
    "req_skills": "",
    "location": "Delhi",
    "status": "open",
    "job_type": "managerial",
    "job_description": [
      {
        "key": "Responsibilities",
        "value": []
      },
      {
        "key": "Application Support:",
        "value": [
          "Provide prompt and effective technical support to end-users, addressing application-related issues and ensuring minimal downtime.",
          "Troubleshoot and diagnose software problems, log and track support requests, and escalate issues to the appropriate teams when necessary.",
          "Collaborate with the IT and development teams to resolve technical issues, implement updates, and perform system upgrades.",
          "Maintain a comprehensive understanding of the organization's applications, their functionality, and their integration with other systems.",
          "Create and maintain documentation related to application support processes, troubleshooting procedures, and issue resolutions.",
          "Monitor system performance, identify and address potential problems, and implement preventive measures to ensure system stability.",
          "Assist in user training and education on application functionality, best practices, and usage guidelines.",
          "Participate in the testing and quality assurance of new software releases, patches, and updates."
        ]
      },
      {
        "key": "Survey:",
        "value": [
          "Survey creation and management",
          "Collaborate with stakeholders to gather survey requirements, ensuring surveys are tailored to specific research goals.",
          "Knowledge of implement survey logic, branching, and advanced features",
          "Ensure data integrity and accuracy in collected survey responses.",
          "Create and maintain documentation related to survey design, development, and best practices.",
          "Train and support end-users in survey creation and administration within the Qualtrics platform."
        ]
      },
      {
        "key": "Technical Competences",
        "value": [
          "Bachelor's degree in Computer Science, Information Technology, or related field.",
          "Proficiency in HTML, CSS, and JavaScript, with the ability to customize survey interfaces and implement advanced features.",
          "Familiarity with database management systems and SQL.",
          "Proven experience in application management or related IT roles.",
          "In-depth knowledge of application deployment, maintenance, and troubleshooting.",
          "Familiarity with various programming languages, databases, and application frameworks.",
          "Familiarity with data analysis concepts, APIs and SQL tools is a plus.",
          "Strong problem-solving and analytical skills.",
          "Excellent communication skills, both written and verbal, to interact effectively with end-users and technical teams.",
          "Ability to work under pressure and handle multiple priorities effectively.",
          "Attention to detail, organizational skills, and the ability to manage multiple tasks simultaneously."
        ]
      },
      {
        "key": "Your role as a leader: ",
        "value": [
          "At Deloitte India, we believe in the importance of leadership at all levels. We expect our people to embrace and live our purpose by challenging themselves to identify issues that are most important for our clients, our people, and for society and make an impact that matters."
        ]
      }
    ],
    "id": 101
  },
  {
    "company_name": "Red Hat",
    "position": "Software Quality Engineer",
    "req_experience": "2+ years ",
    "link": "https://redhat.wd5.myworkdayjobs.com/jobs/job/Pune---Tower-6/software-quality-Enigneer_R-039813-1",
    "company_logo": "assets/images/redhat.gif",
    "skill_vis_check": false,
    "req_skills": "",
    "location": "",
    "status": "open",
    "job_type": "software",
    "job_description": [
      {
        "key": "Position",
        "value": [
          "Quality Engineer"
        ]
      },
      {
        "key": "Qualifications",
        "value": [
          "Bachelor's degree or higher, or equivalent in computer science or a related field",
          "2+ years of professional experience or open source contributions in Quality Engineering",
          "Familiarity with testing methodologies and techniques",
          "Knowledge of the Linux operating system (any distribution) and CI/CD using Openshift Tekton pipeline and Jenkins",
          "Knowledge of test infra development using Virtual VMs and Containerized environments",
          "Programming skills in shell and Python",
          "Ability to work in a fast-paced environment and learn quickly",
          "Solid written and verbal communication skills in English"
        ]
      },
      {
        "key": "Preferred Qualifications",
        "value": [
          "Knowledge of Amazon Web Services (AWS) EC2, Google Compute Engine (GCE), or Microsoft Azure",
          "Knowledge of Linux containers, Kubernetes, Red Hat OpenStack Platform, or Red Hat OpenShift",
          "Knowledge of CI/CD, Jenkins, or Prow",
          "Knowledge of security testing",
          "Contributions to open source projects or publicly available code samples"
        ]
      },
      {
        "key": "Experience",
        "value": [
          "Testing experience working with globally distributed QE team members"
        ]
      },
      {
        "key": "About Red Hat",
        "value": [
          "Red Hat is the world’s leading provider of enterprise open source software solutions, using a community-powered approach to deliver high-performing Linux, cloud, container, and Kubernetes technologies.",
          "Spread across 40+ countries, our associates have the flexibility to choose the work environment that suits their needs from in-office to fully remote to office-flex.",
          "Red Hatters are encouraged to bring their best ideas, no matter their title or tenure.",
          "We're a leader in open source because of our open and inclusive environment.",
          "We hire creative, passionate people ready to contribute their ideas, help solve complex problems, and make an impact."
        ]
      },
      {
        "key": "Diversity, Equity & Inclusion",
        "value": [
          "Red Hat’s culture is built on the open source principles of transparency, collaboration, and inclusion, where the best ideas can come from anywhere and anyone.",
          "When this is realized, it empowers people from diverse backgrounds, perspectives, and experiences to come together to share ideas, challenge the status quo, and drive innovation.",
          "Our aspiration is that everyone experiences this culture with equal opportunity and access, and that all voices are not only heard but also celebrated.",
          "We hope you will join our celebration, and we welcome and encourage applicants from all the beautiful dimensions of diversity that compose our global village."
        ]
      },
      {
        "key": "Equal Opportunity Policy (EEO)",
        "value": [
          "Red Hat is proud to be an equal opportunity workplace and an affirmative action employer.",
          "We review applications for employment without regard to their race, color, religion, sex, sexual orientation, gender identity, national origin, ancestry, citizenship, age, veteran status, genetic information, physical or mental disability, medical condition, marital status, or any other basis prohibited by law."
        ]
      },
      {
        "key": "Additional Information",
        "value": [
          "Red Hat does not seek or accept unsolicited resumes or CVs from recruitment agencies.",
          "We are not responsible for, and will not pay, any fees, commissions, or any other payment related to unsolicited resumes or CVs except as required in a written contract between Red Hat and the recruitment agency or party requesting payment of a fee."
        ]
      },
      {
        "key": "Job Location",
        "value": [
          "56 & 57 Hadapsar Industrial Estate, Pune, MAHARASHTRA, 411013, India"
        ]
      },
      {
        "key": "Job ID",
        "value": [
          "req446508"
        ]
      },
      {
        "key": "Category",
        "value": [
          "Engineering"
        ]
      },
      {
        "key": "Exempt",
        "value": [
          "Yes"
        ]
      }
    ],
    "id": 99
  },
  {
    "company_name": "Honeywell",
    "position": "Software Engr I",
    "req_experience": " 1.5 - 2 Years.",
    "link": "https://careers.honeywell.com/us/en/job/HONEUSREQ446508EXTERNALENUS/Software-Engr-I?utm_source=linkedin&utm_medium=phenom-feeds",
    "company_logo": "assets/images/honeywell.gif",
    "skill_vis_check": false,
    "req_skills": "",
    "location": "Pune, MAHARASHTRA, India",
    "status": "open",
    "job_type": "software",
    "job_description": [
      {
        "key": "Mission",
        "value": [
          "Innovate high-purity, high-performance chemicals and materials"
        ]
      },
      {
        "key": "We Value",
        "value": [
          "Understanding various software development lifecycle",
          "Demonstrate the ability to develop efficient and high-quality software",
          "Knowledge of software configuration management and change management practices",
          "Diverse and global teaming and collaboration",
          "Effective communicator",
          "Can quickly analyze, incorporate and apply new information and concepts",
          "Ability to consistently make timely decisions even in the face of complexity, balancing systematic analysis with decisiveness",
          "Ability to convey subtle or complex messages clearly, as appropriate for the topic and audience",
          "Relevant experience of 2-4 years"
        ]
      },
      {
        "key": "Technical Skills",
        "value": [
          "Hands-on programming experience with C++ with OOPS and Data Structures (Pointers)",
          "Working experience on Linux/CentOS/Solaris, Socket Programming",
          "Scripting (Perl/Shell)",
          "Nice to have .NET experience, Java",
          "Working Experience on SQL",
          "Working experience with Code Version Management Tool like GIT, SVN",
          "Understanding of UML Diagrams (Sequence/Class/State)",
          "Working experience of CI/CD Pipeline like Bamboo"
        ]
      },
      {
        "key": "Behavioral Skills",
        "value": [
          "Problem Solving Attitude",
          "Effective Communication",
          "Time Management"
        ]
      },
      {
        "key": "Requirements",
        "value": [
          "Bachelors degree in Engineering or Computer Science"
        ]
      },
      {
        "key": "Additional Information",
        "value": [
          "JOB ID: req446508",
          "Category: Engineering",
          "Location: 56 & 57 Hadapsar Industrial Estate, Pune, MAHARASHTRA, 411013, India",
          "Exempt"
        ]
      }
    ],
    "id": 98
  },
  {
    "company_name": "6sense",
    "position": "Software Engineer II",
    "req_experience": "1-2+ years ",
    "link": "https://boards.greenhouse.io/embed/job_app?token=6049225",
    "company_logo": "assets/images/6sense.gif",
    "skill_vis_check": false,
    "req_skills": "",
    "location": "Bengaluru, Karnataka, India",
    "status": "open",
    "job_type": "software",
    "job_description": [
      {
        "key": "Company",
        "value": [
          "6sense"
        ]
      },
      {
        "key": "Mission",
        "value": [
          "6sense is on a mission to revolutionize how B2B organizations create revenue by predicting customers most likely to buy and recommending the best course of action to engage anonymous buying teams.",
          "6sense Revenue AI is the only sales and marketing platform to unlock the ability to create, manage and convert high-quality pipeline to revenue."
        ]
      },
      {
        "key": "People",
        "value": [
          "People are the heart and soul of 6sense.",
          "We serve with passion and purpose.",
          "We live by our Being 6sense values of Accountability, Growth Mindset, Integrity, Fun and One Team.",
          "Every 6sensor plays a part in defining the future of our industry-leading technology.",
          "6sense is a place where difference-makers roll up their sleeves, take risks, act with integrity, and measure success by the value we create for our customers."
        ]
      },
      {
        "key": "Career Vision",
        "value": [
          "We want 6sense to be the best chapter of your career."
        ]
      },
      {
        "key": "Company Description",
        "value": [
          "6sense is a Predictive Intelligence Engine that is reimagining how B2B companies do sales and marketing.",
          "It works with big data at scale, advanced machine learning, and predictive modeling to find buyers and predict what they will purchase, when, and how much.",
          "6sense helps B2B marketing and sales organizations fully understand the complex ABM buyer journey.",
          "By combining intent signals from every channel with the industry’s most advanced AI predictive capabilities, it is finally possible to predict account demand and optimize demand generation in an ABM world.",
          "Equipped with the power of AI and the 6sense Demand PlatformTM, marketing and sales professionals can uncover, prioritize, and engage buyers to drive more revenue."
        ]
      },
      {
        "key": "Position",
        "value": [
          "Software Engineer II"
        ]
      },
      {
        "key": "Position Overview",
        "value": [
          "Designing, developing, and deploying customer-centric applications."
        ]
      },
      {
        "key": "Role Expectations",
        "value": [
          "Develop APIs and Microservices that can scale.",
          "Learning new things, asking questions.",
          "Working closely with Product to develop exciting new features.",
          "Iterating on customers’ feedback to continuously improve features.",
          "Writing high-quality tests to ensure all features work as intended."
        ]
      },
      {
        "key": "Qualifications",
        "value": [
          "BE/BTech/BS or equivalent.",
          "Excellent analytical and problem-solving skills.",
          "2+ years of experience in programming with Python and familiarity with frameworks such as Django.",
          "Experience with any RDBMS and strong SQL knowledge.",
          "Comfortable with Unix / Linux command line.",
          "Object-oriented concepts & design patterns. LI-remote."
        ]
      },
      {
        "key": "Benefits",
        "value": [
          "Full-time employees can take advantage of health coverage, paid parental leave, generous paid time-off and holidays, quarterly self-care days off, and stock options.",
          "We’ll make sure you have the equipment and support you need to work and connect with your teams, at home or in one of our offices.",
          "We have a growth mindset culture that is represented in all that we do, from onboarding through to numerous learning and development initiatives including access to our LinkedIn Learning platform.",
          "Employee well-being is also top of mind for us. We host quarterly wellness education sessions to encourage self care and personal growth.",
          "From wellness days to ERG-hosted events, we celebrate and energize all 6sense employees and their backgrounds."
        ]
      }
    ],
    "id": 97
  },
  {
    "company_name": "Oracle",
    "position": "Software Developer 2",
    "req_experience": "0 to 2+ years",
    "link": "https://careers.oracle.com/jobs/#en/sites/jobsearch/job/245605?location=India&locationId=300000000106947",
    "company_logo": "assets/images/oracle.gif",
    "skill_vis_check": false,
    "req_skills": "",
    "location": "",
    "status": "open",
    "job_type": "software",
    "job_description": [
      {
        "key": "Company",
        "value": [
          "Oracle"
        ]
      },
      {
        "key": "Position",
        "value": [
          "Software Engineer - Oracle Cloud Infrastructure (OCI)"
        ]
      },
      {
        "key": "Career Level",
        "value": [
          "IC2"
        ]
      },
      {
        "key": "Job Description",
        "value": [
          "Design, develop, troubleshoot, and debug software programs for databases, applications, tools, networks, etc.",
          "Provide technical leadership to other software developers.",
          "Specify, design, and implement changes to existing software architecture to meet evolving needs."
        ]
      },
      {
        "key": "Responsibilities",
        "value": [
          "Defining and developing software for tasks associated with developing, debugging, or designing software applications or operating systems.",
          "Providing technical leadership and guidance to other software developers.",
          "Specifying, designing, and implementing changes to existing software architecture to meet changing needs.",
          "Building and operating a suite of massive-scale, integrated cloud services in a broadly distributed, multi-tenant cloud environment.",
          "Developing innovative new systems to power customers' business-critical applications.",
          "Owning the software design and development for major components of Oracle’s Cloud Infrastructure.",
          "Designing and building distributed systems interactions.",
          "Operating high-scale services and ensuring their resilience."
        ]
      },
      {
        "key": "About Oracle Cloud Migration Service",
        "value": [
          "The Oracle Cloud Migrations service automates the migration of virtual machines from on-premises environments to Oracle Cloud Infrastructure (OCI).",
          "Using a simple managed connection with your data center, you can discover assets capable of migrating, group source workloads into migration projects, schedule data replication, and launch the migrated virtual machines to OCI."
        ]
      },
      {
        "key": "Required Qualifications",
        "value": [
          "2+ years of distributed service engineering experience in a software development environment.",
          "BS in Computer Science or equivalent experience.",
          "Strong knowledge of data structures, algorithms, operating systems, and distributed systems fundamentals.",
          "Strong development experience in Java, Python, or similar object-oriented languages.",
          "Strong understanding of cloud computing concepts, networking, security, and virtualization technologies.",
          "Experience driving feature design reviews, documentation, UX reviews, and working with Product Managers through the entire launch process.",
          "Experience with Linux/Unix operating systems and scripting languages (e.g., Python, Bash).",
          "Excellent problem-solving and troubleshooting skills.",
          "Ability to work in a fast-paced environment and manage multiple priorities effectively.",
          "Familiarity with containerization technologies like Docker and Kubernetes.",
          "Experience building multi-tenant, virtualized infrastructure is a strong plus."
        ]
      },
      {
        "key": "Preferred Qualifications",
        "value": [
          "Hands-on experience developing services on a public cloud platform (e.g., AWS, Azure, Oracle).",
          "Experience building continuous integration/deployment pipelines with robust testing and deployment schedules.",
          "Experience with Kafka, Apache Spark, Lucene, and other big data technologies."
        ]
      },
      {
        "key": "Required Skills",
        "value": [
          "Algorithms",
          "Cloud Infrastructure",
          "Distributed Systems",
          "Java (Programming Language)",
          "Microservices",
          "Software Development",
          "Terraform"
        ]
      },
      {
        "key": "Additional Information",
        "value": [
          "Oracle is an equal opportunity employer committed to creating an inclusive environment for all employees.",
          "We celebrate diversity and are committed to creating an inclusive environment for all employees."
        ]
      }
    ],
    "id": 95
  },
  {
    "company_name": "Volvo",
    "position": "Software Engineer",
    "req_experience": "",
    "link": "https://jobs.volvocars.com/job/Bengaluru-Software-Engineer-Platform-KA-562122/1093193701/",
    "company_logo": "assets/images/volvo.gif",
    "skill_vis_check": false,
    "req_skills": "",
    "location": "",
    "status": "open",
    "job_type": "software",
    "job_description": [
      {
        "key": "Company",
        "value": [
          "Volvo Cars"
        ]
      },
      {
        "key": "Company Description",
        "value": [
          "At Volvo Cars, we believe that being curious and truly committed to understanding people is the key to future success.",
          "Our purpose is to provide freedom to move, in a personal, sustainable, and safe way.",
          "We simplify customers’ lives by offering better technology solutions that improve their impact on the world and bring the most advanced mobility innovations.",
          "Volvo Cars has over 40,000 employees across the globe and is known for a collaborative, diverse, and inclusive working environment."
        ]
      },
      {
        "key": "Position",
        "value": [
          "Software Engineer - Platform"
        ]
      },
      {
        "key": "Job Location",
        "value": [
          "Bengaluru, KA, IN, 562122"
        ]
      },
      {
        "key": "Job Requisition ID",
        "value": [
          "72091"
        ]
      },
      {
        "key": "Role Overview",
        "value": [
          "Focus on DevOps, Kubernetes, and Docker.",
          "Create new technologies and innovations for safe, sustainable, and convenient mobility.",
          "Work collaboratively with a diverse team."
        ]
      },
      {
        "key": "Company Mission",
        "value": [
          "Provide freedom to move in a personal, sustainable, and safe way.",
          "Improve the impact on the world through advanced technology solutions.",
          "Create safety, autonomous driving, and electrification technologies of tomorrow."
        ]
      },
      {
        "key": "Work Environment",
        "value": [
          "Collaborative, diverse, and inclusive.",
          "Designed around talents and aspirations for employees to reach their full potential.",
          "Committed to making a difference in the world."
        ]
      },
      {
        "key": "Additional Information",
        "value": [
          "Join Volvo Cars on a journey of a lifetime to create innovative mobility solutions."
        ]
      }
    ],
    "id": 94
  },
  {
    "company_name": "Zeta",
    "position": "Software Development Engineer - II Backend",
    "req_experience": "3-4 years",
    "link": "https://www.linkedin.com/jobs/view/3972624217",
    "company_logo": "assets/images/zeta.gif",
    "skill_vis_check": false,
    "req_skills": "",
    "location": "Hyderabad, Telangana, India",
    "status": "open",
    "job_type": "software",
    "job_description": [
      {
        "key": "Company",
        "value": "Zeta"
      },
      {
        "key": "Company Description",
        "value": [
          "Zeta is a Next-Gen Banking Tech company that empowers banks and fintechs to launch banking products for the future.",
          "Founded by Bhavin Turakhia and Ramki Gaddipati in 2015.",
          "Flagship processing platform - Zeta Tachyon - is the industry’s first modern, cloud-native, and fully API-enabled stack.",
          "Working with the largest Banks and Fintechs in multiple global markets transforming customer experience for multi-million card portfolios.",
          "Raised $280 million at a $1.5 billion valuation from Softbank, Mastercard, and other investors in 2021.",
          "Over 1700+ employees - with over 70% roles in R&D - across locations in the US, EMEA, and Asia."
        ]
      },
      {
        "key": "Position",
        "value": "Software Development Engineer II"
      },
      {
        "key": "Role Overview",
        "value": [
          "Play a crucial role in the development and maintenance of our server-side applications.",
          "Work closely with senior backend engineers and cross-functional teams.",
          "Contribute to the design, implementation, and optimization of backend systems."
        ]
      },
      {
        "key": "Responsibilities",
        "value": [
          "Develop, enhance, and maintain high-performance, scalable applications using Java, Spring Boot, and microservices architecture.",
          "Leverage Apache Flink for large-scale data processing.",
          "Utilize PostgreSQL for database management and AWS Athena for complex data queries and analytics.",
          "Collaborate with cross-functional teams to design, implement, and deliver robust software solutions.",
          "Contribute to continuous improvement initiatives ensuring reliability, efficiency, security, and scalability.",
          "Ensure code quality and performance through rigorous testing and continuous integration practices."
        ]
      },
      {
        "key": "Skills",
        "value": [
          "Work with the latest technologies and tools in a team dedicated to innovation and excellence.",
          "Play a crucial role in the daily operations of major financial institutions.",
          "Develop your skills and career in a supportive environment that values learning and professional development.",
          "Join a team that values collaboration, mutual respect, and shared success."
        ]
      },
      {
        "key": "Experience And Qualifications",
        "value": [
          "3-4 years of relevant experience.",
          "Hands-on development experience with Object-Oriented Programming (Java is highly preferred) on a large-scale system."
        ]
      },
      {
        "key": "Equal Opportunity",
        "value": [
          "Zeta is an equal opportunity employer.",
          "We celebrate diversity and are committed to creating an inclusive environment for all employees.",
          "We encourage applicants from all backgrounds, cultures, and communities to apply and believe that a diverse workforce is key to our success."
        ]
      },
      {
        "key": "Additional Information",
        "value": [
          "Learn more @ www.zeta.tech, careers.zeta.tech, Linkedin, Twitter."
        ]
      }
    ],
    "id": 93
  },
  {
    "company_name": "Splunk",
    "position": "Software Engineer",
    "req_experience": "1+ years",
    "link": "https://jobs.jobvite.com/careers/splunk-careers/job/oVIGsfwv?__jvst=Career%20Site",
    "company_logo": "assets/images/splunk.gif",
    "skill_vis_check": false,
    "req_skills": "",
    "location": "Hyderabad, India",
    "status": "open",
    "job_type": "software",
    "job_description": [
      {
        "key": "Company",
        "value": [
          "Splunk"
        ]
      },
      {
        "key": "Company Description",
        "value": [
          "Splunk is a company filled with people who are passionate about our product and seek to deliver the best experience for our customers.",
          "We are committed to our work, customers, having fun, and most importantly, to each other’s success.",
          "At Splunk, observability becomes one of the biggest challenges for engineering teams as applications and systems become more complex.",
          "We are building world-class tools to help engineers deliver better, faster, and more reliable applications."
        ]
      },
      {
        "key": "Position",
        "value": [
          "Software Engineer, Splunk Observability Team"
        ]
      },
      {
        "key": "Role Overview",
        "value": [
          "Splunk is looking for an enthusiastic and innovative Software Engineer to join our Splunk Observability team who will work on systems that empower our customers to quickly detect and resolve their infrastructure and application issues.",
          "You will be a key contributor for the user-facing web application for Splunk Observability Infrastructure Monitoring.",
          "Splunk’s Observability Suite is a leader in the Gartner Magic Quadrant and Infrastructure Monitoring is one of the most used and popular products in this suite."
        ]
      },
      {
        "key": "Responsibilities",
        "value": [
          "Collaborate with product owners and designers to iterate on the design and implementation of our products.",
          "Participate in development of frontend and backend systems.",
          "Follow the best software development practices and participate in code reviews.",
          "Develop code with sufficient test coverage for all appropriate test suite types.",
          "Participate in the operational running of the system at the appropriate level for the team.",
          "Participate in estimating sprint sized software deliverables.",
          "Participate in on-call rotations, post-incident reviews, and other operational duties as needed to ensure stable service delivery."
        ]
      },
      {
        "key": "Requirements",
        "value": [
          "Understanding of modern web applications.",
          "Strong communication skills, both verbal and written.",
          "Experience with web frameworks such as React or Angular.",
          "Solid knowledge of JavaScript, HTML, and CSS.",
          "Experience with Java and/or Go and/or Python and RESTful web services (e.g., Jersey, Spring).",
          "Knowledge of NoSQL or document-oriented databases is a plus.",
          "BS CS or EE degree, or equivalent training or work experience.",
          "2+ years related experience (or Masters without experience)."
        ]
      },
      {
        "key": "Diversity & Inclusion",
        "value": [
          "We value diversity at our company. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, or any other applicable legally protected characteristics in the location in which the candidate is applying.",
          "We will ensure that individuals with disabilities are provided reasonable accommodation to participate in the job application or interview process, to perform essential job functions, and to receive other benefits and privileges of employment.",
          "At Splunk, we believe creating a culture of belonging isn’t just the right thing to do; it’s also the smart thing.",
          "We prioritize diversity, equity, inclusion, and belonging to ensure our employees are supported to bring their best, most authentic selves to work where they can thrive.",
          "Qualified applicants receive consideration for employment without regard to race, religion, color, national origin, ancestry, sex, gender, gender identity, gender expression, sexual orientation, marital status, age, physical or mental disability or medical condition, genetic information, veteran status, or any other consideration made unlawful by federal, state, or local laws.",
          "We consider qualified applicants with criminal histories, consistent with legal requirements."
        ]
      }
    ],
    "id": 92
  },
  {
    "company_name": "JP Morgan Chase & Co.",
    "position": "Software Engineer III - Java",
    "req_experience": " 3+ years",
    "link": "https://jpmc.fa.oraclecloud.com/hcmUI/CandidateExperience/en/sites/CX_1001/job/210533082",
    "company_logo": "assets/images/jpmc.gif",
    "skill_vis_check": false,
    "req_skills": "",
    "location": "HYD",
    "status": "open",
    "job_type": "software",
    "job_description": [
      {
        "key": "JOB DESCRIPTION",
        "value": [
          "We have an exciting and rewarding opportunity for you to take your software engineering career to the next level. ",
          "As a Software Engineer III at JPMorgan Chase within the FRDC team  , you serve as a seasoned member of an agile team to design and deliver trusted market-leading technology products in a secure, stable, and scalable way. You are responsible for carrying out critical technology solutions across multiple technical areas within various business functions in support of the firm’s business objectives."
        ]
      },
      {
        "key": "Job responsibilities",
        "value": [
          "Executes software solutions, design, development, and technical troubleshooting with ability to think beyond routine or conventional approaches to build solutions or break down technical problems",
          "Creates secure and high-quality production code and maintains algorithms that run synchronously with appropriate systems",
          "Produces architecture and design artifacts for complex applications while being accountable for ensuring design constraints are met by software code development",
          "Gathers, analyzes, synthesizes, and develops visualizations and reporting from large, diverse data sets in service of continuous improvement of software applications and systems",
          "Proactively identifies hidden problems and patterns in data and uses these insights to drive improvements to coding hygiene and system architecture",
          "Contributes to software engineering communities of practice and events that explore new and emerging technologies"
        ]
      },
      {
        "key": "Required qualifications, capabilities, and skills",
        "value": [
          "Formal training or certification on software engineering concepts and 3+ years applied experience",
          "Hands-on practical experience in system design, application development, testing, and operational stability",
          "Proficient in coding in one or more languages",
          "Experience in developing, debugging, and maintaining code in a large corporate environment with one or more modern programming languages and database querying languages",
          "Overall knowledge of the Software Development Life Cycle",
          "Solid understanding of agile methodologies such as CI/CD, Application Resiliency, and Security",
          "Demonstrated knowledge of software applications and technical processes within a technical discipline (e.g., cloud, artificial intelligence, machine learning, mobile, etc.)"
        ]
      },
      {
        "key": "Preferred qualifications, capabilities, and skills",
        "value": [
          "Familiarity with modern front-end technologies",
          "Exposure to cloud technologies"
        ]
      }
    ],
    "id": 91
  },
  {
    "company_name": "PayPal",
    "position": "Machine Learning Engineer",
    "req_experience": "4+ years",
    "link": "https://paypal.eightfold.ai/careers?Codes=careercurvv&domain=paypal.com&query=R0112607&sort_by=relevance",
    "company_logo": "assets/images/paypal.gif",
    "skill_vis_check": false,
    "req_skills": "",
    "location": "BLR/HYD",
    "status": "open",
    "job_type": "software",
    "job_description": [
      {
        "key": "Job Description Summary:",
        "value": [
          "What you need to know about the role:",
          "ML Scientist as part of the India Seller Risk ML team at PayPal",
          "Meet our team",
          "Global Seller Risk ML team enables managing seller fulfillment risk for PayPal with the help of highly scalable ML models that enable accurate risk assessment throughout a seller’s lifecycle."
        ]
      },
      {
        "key": "Job Description:",
        "value": [
          "You will actively partner with Risk Strategy teams and build cutting-edge ML models that enable frictionless experience for our good sellers, while minimizing the losses from bad actors in the system."
        ]
      },
      {
        "key": "Your day-to-day",
        "value": [
          "Work with business partners and stakeholders to understand the business, formulate the problems, come up with the solutions and communicate them back effectively to non-technical audience.",
          "Lead complex, multifunctional data science projects",
          "Design, develop and implement real-time, highly complex advanced machine learning models to solve business problems.",
          "Work with large volumes of data; extract and manipulate large datasets using standard tools such as Python, R, H2O, Hadoop and SQL",
          "Collaborate with engineers to implement models on one of the best data platforms in the industry.",
          "Analyze data to identify trends, perform root cause analysis, and test hypotheses.",
          "Communicate complex concepts and the results of the models and analyses to technical and non-technical audiences."
        ]
      },
      {
        "key": "What you need to bring",
        "value": [
          "Bachelors/Masters/Ph D in Computer Science/Data Science with 4+ years of practical experience in building ML models at scale",
          "Strong problem-solving and communication skills",
          "Proven track record of building and implementing machine learning solutions",
          "Experience in leading cross-functional, highly complex Data Science projects",
          "Familiar with various Machine Learning algorithms and Statistical methods.",
          "Strong coding knowledge in Python or other common languages used in ML",
          "Have a passion for working on big data and professional experience in data mining, statistical analysis, predictive modelling, and data manipulation.",
          "Ability to deal with large amounts of data and fluency with SQL or SQL-like tools.  ",
          "Financial services or eCommerce experience a big plus"
        ]
      }
    ],
    "id": 88
  },
  {
    "company_name": "Razorpay",
    "position": "Software Engineer",
    "req_experience": "3-5 Years ",
    "link": "https://boards.greenhouse.io/razorpaysoftwareprivatelimited/jobs/4438935005",
    "company_logo": "assets/images/razorpay.gif",
    "skill_vis_check": false,
    "req_skills": "",
    "location": "Bangalore, India",
    "status": "open",
    "job_type": "software",
    "job_description": [
      {
        "key": "Company Overview",
        "value": [
          "Razorpay was founded by Shashank Kumar and Harshil Mathur in 2014.",
          "Razorpay is building a new-age digital banking hub (Neobank) for businesses in India.",
          "The mission is to enable frictionless banking and payments experiences for businesses of all shapes and sizes.",
          "What started as a B2B payments company is processing billions of dollars of payments for lakhs of businesses across India.",
          "Razorpay is a full-stack financial services organisation, committed to helping Indian businesses with comprehensive and innovative payment and business banking solutions built over robust technology.",
          "Razorpay has disbursed loans worth millions of dollars in loans to thousands of businesses.",
          "Razorpay is reimagining how businesses manage money by simplifying business banking (via Razorpay X) and enabling capital availability for businesses (via Razorpay Capital)."
        ]
      },
      {
        "key": "Position Overview",
        "value": [
          "As Software Developer, you will:",
          "Work with the development team to deliver planned features for client requirements.",
          "Understand the end-user requirements, and develop effective solutions that can deliver client solutions in a scalable and time-bound manner.",
          "Participate in merchant & business discussions to clarify queries, design & implement the required solution for the requirement.",
          "Mentor and Review the code developed by other team members.",
          "Develop innovation strategies, processes, and best practices for Products & implementations.",
          "Lead debug sessions with the team, Support code in production and be a point of escalation to resolve Technical issues.",
          "Take complete ownership of the implementation tasks and drive them to closure.",
          "Own Code maintenance activities, manage Professional service code base and participate in end to end deployment and validation activities."
        ]
      },
      {
        "key": "Required Qualifications",
        "value": [
          "3-5 Years of Experience in the Design and development of web-based applications & microservices architecture.",
          "Minimum of 3 years of hands-on experience working in PHP/Golang/Java Programming languages.",
          "Excellent knowledge of REST architecture & experience in creating Restful APIs.",
          "Experience in interacting with customers to gather & understand requirements.",
          "Strong Experience in analysing Client requirements, Converting them into high-level specs and implementing the same.",
          "Consultative approach to client problems - Must be able to recommend effective solutions.",
          "Must be a self-starter who can work well with minimal guidance and in a fluid environment.",
          "Strong knowledge in any of the Frameworks like PHP Laravel or Golang GIN or Java Spring Boot. (Preferably PHP/Golang)",
          "Object-oriented design and development experience; knowledge of data structures, algorithm design, problem-solving, multi-threading, and complexity analysis.",
          "Strong knowledge in microservices architecture, monitoring & alerting.",
          "Strong Knowledge of SQL, HTML, CSS, Javascript, React JS.",
          "Hands-on experience in Docker & Kubernetes.",
          "Hands-on experience in Github Actions & CI/CD."
        ]
      },
      {
        "key": "Equal Employment Opportunity",
        "value": [
          "Razorpay believes in and follows an equal employment opportunity policy that doesn't discriminate on gender, religion, sexual orientation, colour, nationality, age, etc.",
          "We welcome interests and applications from all groups and communities across the globe."
        ]
      }
    ],
    "id": 87
  },
  {
    "company_name": "Infosys",
    "position": "ServiceNow Developer",
    "req_experience": "Associate",
    "link": "https://career.infosys.com/jobdesc?jobReferenceCode=INFSYS-EXTERNAL-184501",
    "company_logo": "assets/images/ibm.gif",
    "skill_vis_check": false,
    "req_skills": "",
    "location": "BLR",
    "status": "open",
    "job_type": "software",
    "job_description": [
      {
        "key": "Responsibilities",
        "value": [
          "A day in the life of an Infoscion",
          "As part of the Infosys delivery team, your primary role would be to ensure effective Design, Development, Validation and Support activities, to assure that our clients are satisfied with the high levels of service in the technology domain.",
          "You will gather the requirements and specifications to understand the client requirements in a detailed manner and translate the same into system requirements.",
          "You will play a key role in the overall estimation of work requirements to provide the right information on project estimations to Technology Leads and Project Managers.",
          "You would be a key contributor to building efficient programs/ systems and if you think you fit right in to help our clients navigate their next in their digital transformation journey, this is the place for you!",
          "If you think you fit right in to help our clients navigate their next in their digital transformation journey, this is the place for you!"
        ]
      },
      {
        "key": "Technical and Professional Requirements",
        "value": [
          "Technology->Infra_ToolAdministration-ITSM->ServiceNow,",
          "Technology->Infra_ToolAdministration-ITSM->ServiceNow-CSM,",
          "Technology->Infra_ToolAdministration-ITSM->ServiceNow-HRSD",
          "Technology->Infra_ToolAdministration-ITSM->ServiceNow-ITAM",
          "Technology->Infra_ToolAdministration-ITSM->ServiceNow-ITBM",
          "Technology->Infra_ToolAdministration-ITSM->ServiceNow-ITOM",
          "Technology->Infra_ToolAdministration-ITSM->ServiceNow-Security "
        ]
      },
      {
        "key": "Preferred Skills:",
        "value": [
          "Technology->Infra_ToolAdministration-ITSM->ServiceNow ",
          " Technology->Infra_ToolAdministration-ITSM->ServiceNow-ITBM ",
          " Technology->Infra_ToolAdministration-ITSM->ServiceNow-ITOM ",
          " Technology->Infra_ToolAdministration-ITSM->ServiceNow-HRSD ",
          " Technology->Infra_ToolAdministration-ITSM->ServiceNow-Security ",
          " Technology->Infra_ToolAdministration-ITSM->ServiceNow-CSM ",
          " Technology->Infra_ToolAdministration-ITSM->ServiceNow-ITAM "
        ]
      }
    ],
    "id": 86
  },
  {
    "company_name": "CRED",
    "position": "Backend sdet",
    "req_experience": "1-2 years",
    "link": "https://careers.cred.club/openings/3dec7aa5-2ad1-4bbd-b1ec-df6db37c870d?",
    "company_logo": "assets/images/cred.gif",
    "skill_vis_check": false,
    "req_skills": "",
    "location": "",
    "status": "open",
    "job_type": "software",
    "job_description": [
      {
        "key": "Position Overview",
        "value": [
          "Working on a disruptive product that is still in its early stages",
          "Review functional and design specifications to ensure a complete understanding of the system",
          "Taking ownership of the end-to-end system and taking all requirements, issues, and enhancements to closure single-handedly",
          "Develop and maintain the automation framework and scripts for regression and continuous integration",
          "Mentoring other engineers, defining our technical culture, and helping to build a fast-growing team"
        ]
      },
      {
        "key": "Experience",
        "value": [
          "1-3 years of experience as a software development engineer in test"
        ]
      },
      {
        "key": "Qualifications",
        "value": [
          "Backend/API testing experience with strong basics and understanding about backend systems",
          "Prior experience in devising optimal test strategy (including functional, non-functional, analytics, and automation) and test plans for short term and long term projects",
          "Strong hands-on experience on functional and non-functional testing of backend applications",
          "Prior experience in creating test automation frameworks and self-serve tools",
          "Experience in API automation",
          "Strong experience and base in object-oriented design and development",
          "Experience with relational databases and SQL queries",
          "Sharp analytical abilities, proven design skills, excellent communication skills",
          "Experience handling the independent execution with minimal guidance",
          "Prior hands-on experience or understanding on working with Elasticsearch, Redshift, Datadog, AWS, Kibana"
        ]
      }
    ],
    "id": 84
  },
  {
    "company_name": "Microsoft ",
    "position": "Software Engineer",
    "req_experience": "1+ years",
    "link": "https://jobs.careers.microsoft.com/global/en/job/1706092/Software-Engineer",
    "company_logo": "assets/images/microsoft.gif",
    "skill_vis_check": false,
    "req_skills": "",
    "location": "BLR",
    "status": "open",
    "job_type": "software",
    "job_description": [
      {
        "key": "Responsibilities",
        "value": [
          "Design and implement new features and enhancements for Azure Storage services to enable new hardware designs using best practices and industry standards.",
          "Design and implement new features for the storage performance measurement and analysis platform.",
          "Debug and troubleshoot complex issues across multiple software components that block us from enabling new Hardware technologies.",
          "Analyze large scale performance measurement data to find bottlenecks in the software or hardware.",
          "Collaborate with other engineers, product managers, and customers to gather requirements, provide feedback, and deliver solutions.",
          "Document and communicate the design and architecture of the software.",
          "Acts as a Designated Responsible Individual (DRI) and guides other engineers by developing and following the playbook, working on call to monitor system/product/service for degradation, downtime, or interruptions, alerting stakeholders about status and initiates actions to restore system/product/service for simple and complex problems when appropriate.",
          "Proactively seeks new knowledge and adapts to new trends, technical solutions, and patterns that will improve the availability, reliability, efficiency, observability, and performance of products while also driving consistency in monitoring and operations at scale."
        ]
      },
      {
        "key": "Required Qualifications:",
        "value": [
          "Bachelor's Degree in Computer Science, or related technical discipline with proven experience coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python OR equivalent experience."
        ]
      },
      {
        "key": "Other Qualifications",
        "value": [
          "Ability to meet Microsoft, customer and/or government security screening requirements are required for this role. These requirements include, but are not limited to the following specialized security screenings: ",
          "Microsoft Cloud Background Check: This position will be required to pass the Microsoft Cloud Background Check upon hire/transfer and every two years thereafter."
        ]
      },
      {
        "key": "Preferred Qualifications:",
        "value": [
          "Bachelor's Degree in Computer Science or related technical field AND 1+ year(s) technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python",
          "OR Master's Degree in Computer Science or related technical field with proven experience coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python",
          "OR equivalent experience.",
          "Experience with",
          "any NoSQL database, such as MongoDB, Cassandra, Redis,",
          "AND RESTful APIs, microservices, distributed systems, and data structures,",
          "AND ystems programming, operating systems, distributed systems, databases, cloud services including high-performance distributed storage and networking."
        ]
      }
    ],
    "id": 78
  },
  {
    "company_name": "Amdocs",
    "position": "Software Engineer",
    "req_experience": "0+ Years",
    "link": "https://amdocs.eightfold.ai/careers?location=IN&pid=563430997622433&domain=amdocs.com&sort_by=relevance",
    "company_logo": "assets/images/amdocs.gif",
    "skill_vis_check": false,
    "req_skills": "",
    "location": "Pune, India",
    "status": "open",
    "job_type": "software",
    "job_description": [
      {
        "key": "Who are we?",
        "value": [
          "Amdocs helps those who build the future to make it amazing.",
          "With our market-leading portfolio of software products and services, we unlock our customers’ innovative potential, empowering them to provide next-generation communication and media experiences for both the individual end user and enterprise customers.",
          "Our approximately 30,000 employees around the globe are here to accelerate service providers’ migration to the cloud, enable them to differentiate in the 5G era, and digitalize and automate their operations.",
          "Listed on the NASDAQ Global Select Market, Amdocs had revenue of $4.89 billion in fiscal 2023."
        ]
      },
      {
        "key": "In one sentence",
        "value": [
          "Responsible for design, development, modification, debug and/or maintenance of software systems."
        ]
      },
      {
        "key": "What will your job look like?",
        "value": [
          "Perform Development & Support activities for Data warehousing domain using Big Data Technologies.",
          "Understand High Level Design, Application Interface Design & build Low Level Design.",
          "Perform application analysis & propose technical solution for application enhancement or resolve production issues.",
          "Perform Development & Deployment. Should be able to Code, Unit Test & Deploy.",
          "Create necessary documentation for all project deliverable phases.",
          "Handle Production Issues (Tier 2 Support, weekend on-call rotation) to resolve production issues & ensure SLAs are met."
        ]
      },
      {
        "key": "All you need is...",
        "value": [
          "Technical Skills:",
          "Mandatory:",
          "Data Engineering: Strong Experience on one of the big data platforms (Hadoop / Snowflake/ ADLS / Big query).",
          "Hands-on experience with Python/Java programming.",
          "Experience with Spark or Azure Data bricks.",
          "Strong SQL analysis skills.",
          "Experience working with Kafka.",
          "Sound knowledge of Unix Scripting.",
          "Good to have:",
          "Cloud Skills – should have knowledge on either AWS or Azure or GLP.",
          "Sound knowledge of Kubernetes and deployment methodologies.",
          "Database Skills – Strong experience in Oracle and Data replication concepts."
        ]
      },
      {
        "key": "Behavioral skills",
        "value": [
          "Eagerness & Hunger to learn.",
          "Good problem solving & decision making skills.",
          "Good communication skills within the team, site and with the customer.",
          "Ability to stretch respective working hours when necessary, to support business needs.",
          "Ability to work independently and drive issues to closure.",
          "Consult when necessary with relevant parties, raise timely risks.",
          "Effectively handle multiple and complex work assignments, while consistently delivering high quality work."
        ]
      },
      {
        "key": "Why you will love this job",
        "value": [
          "You will be challenged to design and develop new software applications.",
          "You will have the opportunity to work in a growing organization, with ever growing opportunities for personal growth."
        ]
      }
    ],
    "id": 76
  },
  {
    "company_name": "Myntra",
    "position": "Software Engineer",
    "req_experience": "1+ years",
    "link": "https://boards.greenhouse.io/myntra/jobs/7465167002?gh_src=bb272d8c2",
    "company_logo": "assets/images/myntra.gif",
    "skill_vis_check": false,
    "req_skills": "",
    "location": "Bangalore, India",
    "status": "open",
    "job_type": "software",
    "job_description": [
      {
        "key": "About the job",
        "value": [
          "Software Engineer (Frontend) - SCM IB",
          "Location: Not specified"
        ]
      },
      {
        "key": "About Team",
        "value": [
          "SCM Inbound - The SCM Inbound engineering at Myntra encompasses the Pricing & Promotion, Buying & Selection, Catalog Management, Partner Management, Manufacturing Engineering, Market Intelligence & Finance Engineering teams.",
          "Myntra Supply Chain Management systems form the backbone of our core business and customer experience. Any business runs on a simple construct of Demand (Consumer) and Supply (Producer).",
          "However, a set of complex and intricate methods, processes and systems connect the demand with supply in a deterministic and predictable way.",
          "These methods, processes and systems collectively form the Supply Chain for the business.",
          "The multi-billion-dollar Myntra business fundamentally rests on a set of highly scalable, robust and intelligent Supply Chain Management systems that solve real world problems of predicting the demand from millions of our customers, for a combination of millions of products from our product catalog, and intelligently connecting that demand to thousands of national and international sellers or suppliers using a set of advanced homegrown tech products that we build and manage.",
          "SCM engineering employs new-age technologies such as Distributed Computing constructs, Machine Learning, Deep Learning, Computer Vision, Artificial Intelligence; scalable data stores in Mongo, Redis, Cassandra, MySQL, Elastic Search, scalable programming constructs in Node.js, GoLang, Java; JavaScript, Python, Big Data processing and new age frameworks such as Springboot and ReactJS to solve some of the hardest problems in the e-commerce business with world-class software products."
        ]
      },
      {
        "key": "Roles and Responsibilities",
        "value": [
          "Develop and maintain web applications using ReactJS.",
          "Write well-designed, efficient code.",
          "Translate product requirements & user stories.",
          "Work closely with UI/UX team to translate the design into actual implementation.",
          "Participate in discussion, planning, and brainstorming with teammates and stakeholders to achieve project goals.",
          "Maintain code and write unit tests to ensure the product is of the highest quality."
        ]
      },
      {
        "key": "Qualifications & Experience",
        "value": [
          "Bachelor’s in computer science or relevant fields.",
          "1+ years of relevant experience in developing front-end for web based products.",
          "Experience in Javascript (ReactJS / Redux), HTML, CSS, SCSS, Webpack, TypeScript.",
          "Building advanced responsive layouts.",
          "Strong sense of ownership.",
          "Attitude for getting things done.",
          "Experience using RESTful APIs.",
          "Proficient with version control systems, especially GIT, a plus.",
          "Will be involved in developing any enterprise systems like eCommerce, manufacturing, supply chain, etc."
        ]
      }
    ],
    "id": 75
  },
  {
    "company_name": "JPMorgan Chase",
    "position": "Software Engineer II - Python Flask",
    "req_experience": "2+ years",
    "link": "https://jpmc.fa.oraclecloud.com/hcmUI/CandidateExperience/en/sites/CX_1001/job/210524454",
    "company_logo": "assets/images/jpmc.gif",
    "skill_vis_check": false,
    "req_skills": "",
    "location": "BLR",
    "status": "open",
    "job_type": "software",
    "job_description": [
      {
        "key": "JOB DESCRIPTION",
        "value": [
          "You’re ready to gain the skills and experience needed to grow within your role and advance your career — and we have the perfect software engineering opportunity for you.",
          "As a Software Engineer II at JPMorgan Chase within the Risk Tech, you are part of an agile team that works to enhance, design, and deliver the software components of the firm’s state-of-the-art technology products in a secure, stable, and scalable way. As an emerging member of a software engineering team, you execute software solutions through the design, development, and technical troubleshooting of multiple components within a technical product, application, or system, while gaining the skills and experience needed to grow within your role."
        ]
      },
      {
        "key": "Job responsibilities",
        "value": [
          "Executes standard software solutions, design, development, and technical troubleshooting",
          "Writes secure and high-quality code using the syntax of at least one programming language with limited guidance",
          "Designs, develops, codes, and troubleshoots with consideration of upstream and downstream systems and technical implications",
          "Applies knowledge of tools within the Software Development Life Cycle toolchain to improve the value realized by automation",
          "Applies technical troubleshooting to break down solutions and solve technical problems of basic complexity",
          "Gathers, analyzes, and draws conclusions from large, diverse data sets to identify problems and contribute to decision-making in service of secure, stable application development",
          "Learns and applies system processes, methodologies, and skills for the development of secure, stable code and systems",
          "Adds to team culture of diversity, equity, inclusion, and respect"
        ]
      },
      {
        "key": "Required qualifications, capabilities, and skills",
        "value": [
          "Formal training or certification on software engineering concepts and 2 + years development experience in Python along with Flask framework",
          "Strong fundamentals on web server and RDBMS.",
          "Knowledge of OOPS concepts, data structures and algorithms.",
          "Hands-on practical experience in system design, application development, testing, and operational stability",
          "Experience in developing, debugging, and maintaining code in a large corporate environment with one or more modern programming languages and database querying languages",
          "Strong understanding of code version control solutions like git.",
          "Experience across the whole Software Development Life Cycle",
          "Exposure to agile methodologies such as CI/CD, Application Resiliency, and Security",
          "Emerging knowledge of software applications and technical processes within a technical discipline (e.g., cloud, artificial intelligence, machine learning, mobile, etc.)"
        ]
      },
      {
        "key": "Preferred qualifications, capabilities, and skills",
        "value": [
          "Experience with ReactJS and/or other similar UI Frameworks is desirable.",
          "Exposure to cloud technologies",
          "Understanding of Financial products or prior experience in investment banking or risk management is an added plus.",
          "Experience in Distributed computing, multithreading and multiprocessing environment is desirable"
        ]
      }
    ],
    "id": 70
  },
  {
    "company_name": "Google",
    "position": "Software Engineer III, YouTube",
    "req_experience": "2+ years",
    "link": "https://www.google.com/about/careers/applications/jobs/results/141034928132235974-software-engineer-iii/",
    "company_logo": "assets/images/google.gif",
    "skill_vis_check": false,
    "req_skills": "",
    "location": "BLR",
    "status": "open",
    "job_type": "software",
    "job_description": [
      {
        "key": "Minimum qualifications:",
        "value": [
          "Bachelor’s degree or equivalent practical experience.",
          "2 years of experience with software development in one or more programming languages, or 1 year of experience with an advanced degree.",
          "2 years of experience with data structures or algorithms."
        ]
      },
      {
        "key": "Preferred qualifications:",
        "value": [
          "Master's degree or PhD in Computer Science or related technical fields.",
          "Experience developing accessible technologies."
        ]
      },
      {
        "key": "Responsibilities",
        "value": [
          "Write product or system development code.",
          "Participate in, or lead design reviews with peers and stakeholders to decide amongst available technologies.",
          "Review code developed by other developers and provide feedback to ensure best practices (e.g., style guidelines, checking code in, accuracy, testability, and efficiency).",
          "Contribute to existing documentation or educational content and adapt content based on product/program updates and user feedback.",
          "Triage product or system issues and debug/track/resolve by analyzing the sources of issues and the impact on hardware, network, or service operations and quality."
        ]
      }
    ],
    "id": 66
  },
  {
    "company_name": "Postman",
    "position": "Software Engineer I - Full Stack, API Builder",
    "req_experience": "0+ years",
    "link": "https://boards.greenhouse.io/postman/jobs/6033889003?gh_src=7ad26f843us",
    "company_logo": "assets/images/postman.gif",
    "skill_vis_check": false,
    "req_skills": "",
    "location": "BLR",
    "status": "close",
    "job_type": "software",
    "job_description": [
      {
        "key": "Who are we?",
        "value": [
          "Postman is the world’s leading API platform, used by more than 30 million developers and 500,000 organizations, including 98% of the Fortune 500. Postman is helping developers and professionals across the globe build the API-first world by simplifying each step of the API lifecycle and streamlining collaboration—enabling users to create better APIs, faster.",
          "The company is headquartered in San Francisco and has an office in Bangalore, where it was founded. Postman is privately held, with funding from Battery Ventures, BOND, Coatue, CRV, Insight Partners, and Nexus Venture Partners. Learn more at Postman API Platform | Sign Up for Free or connect with Postman on Twitter via @getpostman.",
          "We seek a Software Engineer to join our team and deliver excellent service for a leading global SaaS company with millions of users. You will engage with customers, both technical and non-technical, on a personal level. Familiarity with key languages like JavaScript, Node.js, and PHP is highly valued. Don't hesitate to apply even if you don't meet all the requirements - we welcome applicants from diverse backgrounds, including those without customer-facing experience.",
          "P.S: We highly recommend reading The 'API-First World' graphic novel to understand the bigger picture and our vision at Postman."
        ]
      },
      {
        "key": "About the team:",
        "value": [
          "At API Builder, our vision is to transform the way people design and prototype their APIs. We are one of the new Product Incubation teams within Postman, trying to bring new ideas to market by deeply understanding our customer's needs and iterating fast.",
          "If you are aware of API Schemas like OpenAPI, AsyncAPI, gRPC and love Postman Collections, this is an opportunity to build an API Designer that works closely with Collections and these specifications to help customers design good and secure APIs in collaboration with other developers.",
          "For you, this is an opportunity to be an early member of a team that owns and delivers a product which will be used by millions of developers and business professionals worldwide."
        ]
      },
      {
        "key": "What You’ll Do:",
        "value": [
          "Apply your knowledge to improve Postman’s API Designer while contributing to rest of Postman’s API Platform",
          "Consistently deliver high-quality products, from design to implementation to release with high-level guidance from manager and teammates, while working with a cross-functional team of other Developers, Product Managers, Designers, Support and Product, Quality, Security and Platform Engineers.",
          "Able to navigate complex and ambiguous situations with the team and contribute to a positive sense of community on the team.",
          "Other major responsibilities include code reviews, product discussions, working with support teams and actively contributing to the platform's overall maturity. "
        ]
      },
      {
        "key": "About You:",
        "value": [
          "You have at least one year experience of building Desktop and/or Web Applications. Proficiency with React.Js, Javascript/Typescript, node.js is a big plus.",
          "You are not limited to working in the browser or the server, and are excited about learning and contributing across the stack.",
          "You understand that while your primary responsibility is to design, build, and maintain client-side applications, you do so within the context of building an excellent product with a team.",
          "You have empathy for the end users and your teammates. This reflects in how usable your product is, how you write your code, and how you work with others."
        ]
      }
    ],
    "id": 65
  },
  {
    "company_name": "Red Hat",
    "position": "Software Engineer - Fullstack",
    "req_experience": " 0+ years ",
    "link": "https://redhat.wd5.myworkdayjobs.com/jobs/job/Remote-India/Software-Engineer---Fullstack_R-038009?%2526iisn=LinkedIn%252BPosting&source=LinkedIn&%2526%253Fmode=job&%2526iis=Job%252BBoard",
    "company_logo": "assets/images/redhat.gif",
    "skill_vis_check": false,
    "req_skills": "",
    "location": "Remote India",
    "status": "open",
    "job_type": "software",
    "job_description": [
      {
        "key": "About the job",
        "value": [
          "Systems Design Engineer",
          "Location: Remote in India",
          "Company: Red Hat"
        ]
      },
      {
        "key": "Job Description",
        "value": [
          "The Learning Platforms team is seeking a Systems Design Engineer to join our distributed team remotely in India. As a key member of our team, you will be working on the landscape of Red Hat Training products, including Red Hat Learning Subscription, Red Hat Academy Learning Platform, Red Hat Skills Assessment, Survey tools, and more.",
          "You will be working with both front-end and back-end parts of an application.",
          "You will be a part of a team distributed across North America, South America, Europe and Asia.",
          "You will get to work with the following technical stack: Python, Django REST API, ReactJS, Typescript, Elasticsearch, OpenShift.",
          "You will work both on your own and in tight collaboration and regular communication with other team members.",
          "You will get to drive features to completion in a collaborative environment: from initial design through implementation, to testing and go-live."
        ]
      },
      {
        "key": "Primary job responsibilities",
        "value": [
          "Introduce new features and maintain the codebase across different training products.",
          "Fix bugs in, update, and maintain existing projects.",
          "Perform and promote good development practices like code review and writing tests.",
          "Collaborate with the engineering and operations teams on improving deployment procedures and monitoring.",
          "Collaborate with cross-functional teams including engineers, product managers, and UX designers to deliver innovative features.",
          "Communicate deliverables and deadlines to product owners.",
          "Enhance code quality, eliminate inconsistencies, and contribute to continuous improvement.",
          "Share technical knowledge during engineering meetings and provide valuable input on system enhancements."
        ]
      },
      {
        "key": "Required skills",
        "value": [
          "Prior experience developing REST APIs using Python.",
          "Experience developing Single Page Applications in ReactJS with Typescript or other comparable framework.",
          "Knowledge of testing practices (unit testing, continuous integration, etc).",
          "Experience integrating with external APIs.",
          "Problem-solving and critical thinking skills.",
          "Experience with Linux container technologies (Docker or podman) and Linux systems administration.",
          "Experience with GitHub, GitLab, or other collaborative code forges.",
          "Ability to understand and describe technical problems to address them with the team.",
          "Strong communication skills."
        ]
      },
      {
        "key": "Preferred skills",
        "value": [
          "OpenShift administration skills.",
          "Knowledge of Elasticsearch and GraphQL.",
          "Experience with ArgoCD.",
          "Experience with Amazon Web Services (AWS).",
          "Knowledge of end-to-end testing frameworks such as Selenium."
        ]
      },
      {
        "key": "About Red Hat",
        "value": [
          "Red Hat is the world’s leading provider of enterprise open source software solutions, using a community-powered approach to deliver high-performing Linux, cloud, container, and Kubernetes technologies.",
          "Spread across 40+ countries, our associates have the flexibility to choose the work environment that suits their needs from in-office to fully remote to office-flex.",
          "We're a leader in open source because of our open and inclusive environment.",
          "We hire creative, passionate people ready to contribute their ideas, help solve complex problems, and make an impact."
        ]
      },
      {
        "key": "Diversity, Equity & Inclusion at Red Hat",
        "value": [
          "Red Hat’s culture is built on the open source principles of transparency, collaboration, and inclusion, where the best ideas can come from anywhere and anyone.",
          "When this is realized, it empowers people from diverse backgrounds, perspectives, and experiences to come together to share ideas, challenge the status quo, and drive innovation.",
          "Our aspiration is that everyone experiences this culture with equal opportunity and access, and that all voices are not only heard but also celebrated.",
          "We hope you will join our celebration, and we welcome and encourage applicants from all the beautiful dimensions of diversity that compose our global village."
        ]
      },
      {
        "key": "Equal Opportunity Policy (EEO)",
        "value": [
          "Red Hat is proud to be an equal opportunity workplace and an affirmative action employer.",
          "We review applications for employment without regard to their race, color, religion, sex, sexual orientation, gender identity, national origin, ancestry, citizenship, age, veteran status, genetic information, physical or mental disability, medical condition, marital status, or any other basis prohibited by law.",
          "Red Hat does not seek or accept unsolicited resumes or CVs from recruitment agencies. We are not responsible for, and will not pay, any fees, commissions, or any other payment related to unsolicited resumes or CVs except as required in a written contract between Red Hat and the recruitment agency or party requesting payment of a fee.",
          "Red Hat supports individuals with disabilities and provides reasonable accommodations to job applicants.",
          "If you need assistance completing our online job application, email application-assistance@redhat.com.",
          "General inquiries, such as those regarding the status of a job application, will not receive a reply."
        ]
      }
    ],
    "id": 63
  },
  {
    "company_name": "AIRBUS",
    "position": "Software Engineer",
    "req_experience": " 0+ years ",
    "link": "https://ag.wd3.myworkdayjobs.com/en-US/Airbus/job/Bangalore-Area/Software-Engineer_JR10272819",
    "company_logo": "assets/images/airbus.gif",
    "skill_vis_check": false,
    "req_skills": "",
    "location": ", Bengaluru, India",
    "status": "open",
    "job_type": "software",
    "job_description": [
      {
        "key": "Job Description",
        "value": [
          "The Software Engineer contributes to industrial projects on Simulation Modelling and optimisation by developing custom software libraries.",
          "Evaluate current and future industrial system needs and develop the logistic and manufacturing simulation libraries in Discrete Event Simulation environment.",
          "Use and execute process, method and tools dedicated to Industrial system design.",
          "Support Industrial Flow simulation modelling and key Airbus industrial challenges by providing suitable software libraries.",
          "Testing the Industrial System Manufacturing Line design way of working through pilot cases in the plants/FAL’s following the Industrial deployment strategy with a 'I do, we do, you do' logic."
        ]
      },
      {
        "key": "Required Skills",
        "value": [
          "Software Programming preferably Java",
          "Logical thinking",
          "Software development, deployment and testing",
          "Problem solving"
        ]
      },
      {
        "key": "Compliance",
        "value": [
          "This job requires an awareness of any potential compliance risks and a commitment to act with integrity, as the foundation for the Company’s success, reputation and sustainable growth."
        ]
      },
      {
        "key": "Company Description",
        "value": [
          "Airbus India Private Limited"
        ]
      },
      {
        "key": "Employment Type",
        "value": [
          "Internship"
        ]
      },
      {
        "key": "Experience Level",
        "value": [
          "Student"
        ]
      },
      {
        "key": "Job Family",
        "value": [
          "Manufacturing Engineering "
        ]
      },
      {
        "key": "Privacy Consent",
        "value": [
          "By submitting your CV or application you are consenting to Airbus using and storing information about you for monitoring purposes relating to your application or future employment. This information will only be used by Airbus."
        ]
      },
      {
        "key": "Diversity and Inclusion",
        "value": [
          "Airbus is committed to achieving workforce diversity and creating an inclusive working environment. We welcome all applications irrespective of social and cultural background, age, gender, disability, sexual orientation or religious belief.",
          "Airbus is, and always has been, committed to equal opportunities for all. As such, we will never ask for any type of monetary exchange in the frame of a recruitment process. Any impersonation of Airbus to do so should be reported to emsom@airbus.com."
        ]
      },
      {
        "key": "Flexible Working",
        "value": [
          "At Airbus, we support you to work, connect and collaborate more easily and flexibly. Wherever possible, we foster flexible working arrangements to stimulate innovative thinking."
        ]
      }
    ],
    "id": 57
  },
  {
    "company_name": "JP Morgan Chase & Co.",
    "position": "Software Engineer",
    "req_experience": " 0+ years ",
    "link": "https://jpmc.fa.oraclecloud.com/hcmUI/CandidateExperience/en/sites/CX_1001/job/210512342",
    "company_logo": "assets/images/jpmc.gif",
    "skill_vis_check": false,
    "req_skills": "",
    "location": ", Bengaluru, India",
    "status": "open",
    "job_type": "software",
    "job_description": [
      {
        "key": "Job Description",
        "value": [
          "As a member of our Quality Assurance team, your goal is to ensure that our applications work as they should and meet customers' needs.",
          "You'll join one of our high-performing QA teams, drawing on your testing knowledge and creativity to automate test capabilities and design test and maintenance procedures.",
          "You'll also tap our existing test frameworks to tackle specific problems.",
          "We take a collaborative approach to quality, working with experienced developers, managers, and business partners across the organization.",
          "You'll receive coaching, mentorship, and continuous feedback to help you become an even better technologist and professional."
        ]
      },
      {
        "key": "Required Skills",
        "value": [
          "BS/BA, ME/MS/Mtech degree or equivalent.",
          "Proven ability to write automated tests for web and mobile.",
          "Hands-on experience in JAVA, Selenium, Jenkins, OOP's concept.",
          "Good Understanding of JIRA.",
          "Good to have Agile knowledge.",
          "Detailed understanding of common defect and data-management tools.",
          "Advanced knowledge of software lifecycles, including Waterfall and Agile, and test automation strategies.",
          "Experience working effectively with teams and stakeholders to develop relationships and achieve common goals.",
          "Proficiency in a business function and some understanding of the broader business context."
        ]
      },
      {
        "key": "Company Description",
        "value": [
          "JPMorgan Chase & Co., one of the oldest financial institutions, offers innovative financial solutions to millions of consumers, small businesses, and many of the world’s most prominent corporate, institutional, and government clients under the J.P. Morgan and Chase brands.",
          "Our history spans over 200 years and today we are a leader in investment banking, consumer and small business banking, commercial banking, financial transaction processing, and asset management.",
          "We recognize that our people are our strength and the diverse talents they bring to our global workforce are directly linked to our success.",
          "We are an equal opportunity employer and place a high value on diversity and inclusion at our company.",
          "We do not discriminate on the basis of any protected attribute, including race, religion, color, national origin, gender, sexual orientation, gender identity, gender expression, age, marital or veteran status, pregnancy or disability, or any other basis protected under applicable law.",
          "We also make reasonable accommodations for applicants’ and employees’ religious practices and beliefs, as well as mental health or physical disability needs."
        ]
      },
      {
        "key": "Team Description",
        "value": [
          "Our Consumer & Community Banking division serves our Chase customers through a range of financial services, including personal banking, credit cards, mortgages, auto financing, investment advice, small business loans, and payment processing.",
          "We’re proud to lead the U.S. in credit card sales and deposit growth and have the most-used digital solutions – all while ranking first in customer satisfaction."
        ]
      }
    ],
    "id": 55
  },
  {
    "company_name": "Accenture",
    "position": "Application Tech Support Practitioner",
    "req_experience": "0 - 2 years",
    "link": "https://www.accenture.com/in-en/careers/jobdetails?id=ATCI-4380570-S1722569_en",
    "company_logo": "assets/images/accenture.gif",
    "skill_vis_check": false,
    "req_skills": "",
    "location": "BLR",
    "status": "open",
    "job_type": "software",
    "job_description": [
      {
        "key": "Job Description",
        "value": [
          "<b>Project Role</b> : Application Tech Support Practitioner",
          " <b>Project Role Description</b> : Act as the ongoing interface between the client and the system or application. Dedicated to quality, using exceptional communication skills to keep our world class systems running. Can accurately define a client issue and can interpret and design a resolution based on deep product knowledge.",
          "<b>Must have skills </b>: Service Desk Management, Service Desk Voice Support, Japanese",
          "<b>Good to have skills </b>: NA",
          "Minimum 0-2 year(s) of experience is required",
          "<b>Educational Qualification</b> : Graduate"
        ]
      },
      {
        "key": "Qualifications",
        "value": [
          "Graduate"
        ]
      }
    ],
    "id": 52
  },
  {
    "company_name": "Visa",
    "position": "SW Engineer",
    "req_experience": "1+ years",
    "link": "https://jobs.smartrecruiters.com/Visa/743999992938495-sw-engineer",
    "company_logo": "assets/images/visa.gif",
    "skill_vis_check": false,
    "req_skills": "",
    "location": "BLR",
    "status": "open",
    "job_type": "software",
    "job_description": [
      {
        "key": "Company Description",
        "value": [
          "Visa is a world leader in payments and technology, with over 259 billion payments transactions flowing safely between consumers, merchants, financial institutions, and government entities in more than 200 countries and territories each year. Our mission is to connect the world through the most innovative, convenient, reliable, and secure payments network, enabling individuals, businesses, and economies to thrive while driven by a common purpose – to uplift everyone, everywhere by being the best way to pay and be paid.",
          "Mastercard’s software engineering teams leverage Agile development principles, advanced development and design practices, and an obsession over security, reliability, and performance to deliver solutions that delight our customers. As a software development engineer, you’ll develop advanced technologies and applications that are revolutionizing payments."
        ]
      },
      {
        "key": "Job Description",
        "value": [
          "As a Software Engineer, you will be part of our  Domestic Processing team in Payment Processing to help design, enhance and build our transactional processing system in an agile development environment. You will work with colleagues who will support and challenge you daily. You will be part of teams tasked with multiple projects building full stack development of real-time transactional services, REST services API and Container based services that are highly functional, distributed, secure, scalable and resilient. We believe in self managing Agile teams who build products end to end focusing on unit testing, code reviews and continuous integration for excellent code quality. You will see the code written and moved to production within just a few days, to then be used by a huge customer base including Facebook, Nike, FedEx, Apple to name a few. As part of this organization , you will get an opportunity to work on a highly scalable system which processes around 400 tps 24/7"
        ]
      },
      {
        "key": "Some of Your Key Responsibilities",
        "value": [
          "As a Software Engineer you will help design, enhance, and build next generation fraud detection platforms in an agile development environment.",
          "You will play part of multiple teams tasked with projects ranging from full stack development, Rest based APIs, Container based services to highly functional, secure, scalable, and resilient systems.",
          "Contribute to release planning exercise, assign, and track work of team members to timely releases.",
          "Responsibilities include technical analysis and creation of conceptual approach.",
          "Develop code that complies with design specifications and meets security and Java best practices.",
          "Coding must adhere security standards, be easily maintainable and be high performant.",
          "Participate in design and code review sessions as appropriate to ensure the quality of work delivered by self and teammates are in accordance with development standards.",
          "Collaborate with business partners on requirements elaboration, design, configuration, and business re-engineering.",
          "Present technical solutions, capabilities, considerations, and features in business terms. Effectively communicate status, issues, and risks in a precise and timely manner.",
          "Design and execute test plans, scenarios and scripts",
          "Document software defects, using a bug tracking system, and report defects",
          "This is a hybrid position. Hybrid employees can alternate time between both home and office. Employees in hybrid roles are expected to work from the office three days a week, Monday (Sunday in some countries where Sunday is the start of the week) and Wednesdays. Wednesdays are designated as in-office collaboration days. The third day in the office will be decided based on team needs and determined in partnership with senior leadership."
        ]
      },
      {
        "key": "Qualifications",
        "value": [
          "Bachelors degree, OR 1-2+ years of relevant work experience"
        ]
      },
      {
        "key": "Preferred Qualifications",
        "value": [
          "2 or more years of work experience",
          "Bachelor’s degree in Computer Science, Computer Information Systems, Computer Engineering, or related field, and 1 year work experience in the job offered or in a computer-related occupation",
          "Experience in full stack technology, in one or more of the following technologies- Java, Spring MVC, Spring Boot, Angular, JavaScript, MySQL, Maven, Design Patterns, Test Automation framework",
          "Ability to present complex ideas in a clear, concise way.",
          "Experience with agile development incorporating continuous integration and continuous delivery.",
          "Strong facilitation and analytical skills with excellent problem-solving ability",
          "Good interpersonal skills and communication",
          "Passionate about delivering zero defect code that meet or exceed the proposed defect SLA and have high sense of accountability for quality and timeliness of one’s own deliverables and team deliverables",
          "Highly driven, resourceful and results oriented",
          "Be systematic and be able to do deep research wanting to uncover the details",
          "Have good work ethics, and be a team player to bring the best results as a",
          "Bachelor’s degree in Computer Science, Computer Information Systems, Computer Engineering, or related field, and 2 years work experience in the job offered or in a computer-related occupation",
          "Experience with agile development incorporating Continuous Integration and Continuous Delivery, utilizing technologies such as GIT, Maven, and Jenkins",
          "Experience with successful design, architecture and development using Hadoop, and Spark and Scala for large data processing and transaction systems.",
          "Experience with Restful API development",
          "Expertise in web applications and webservices, technology standards and frameworks",
          "Experienced in test-driven development and test automation and manual testing",
          "Experience with build automation tools - Jenkins, Artifactory, Maven is required, Knowledge of Code Coverage tools like Ecl/Emma or SonarQube are desired.",
          "Experience in card industry or fintech delivering solutions in fraud, risk or payments space.",
          "Experience in developing large scale, enterprise class distributed systems of high availability, low latency, & strong data consistency",
          "Experience developing instrumentation for software components, to help facilitate real-time and remote troubleshooting/performance monitoring."
        ]
      }
    ],
    "id": 49
  },
  {
    "company_name": "Infosys",
    "position": "Process Executive",
    "req_experience": "freshers",
    "link": "https://career.infosys.com/jobdesc?source=44003&jobReferenceCode=PROGEN-EXTERNAL-181316",
    "company_logo": "assets/images/infosys.gif",
    "skill_vis_check": false,
    "req_skills": "",
    "location": "Mysore",
    "status": "open",
    "job_type": "software",
    "job_description": [
      {
        "key": "Responsibilities",
        "value": [
          " Fresher",
          "- 0 to 1 year with good communication skills",
          "- Multi-tasking abilities and the ability to work in a fast paced environment. ",
          "- Able to interpret data from both technical and business perspective "
        ]
      },
      {
        "key": "Educational Requirements",
        "value": [
          "Graduate "
        ]
      }
    ],
    "id": 47
  },
  {
    "company_name": "Walmart",
    "position": "Senior Software Engineer",
    "req_experience": "5+ YEARS",
    "link": "https://walmart.wd5.myworkdayjobs.com/WalmartExternal/login?redirect=%2FWalmartExternal%2Fjob%2FIN-KA-BANGALORE-Home-Office-PW-II%2FXMLNAME--IND--SENIOR--SOFTWARE-ENGINEER_R-1886072-1%2Fapply%3Fsource%3DLinkedIn",
    "company_logo": "assets/images/walmart.gif",
    "skill_vis_check": false,
    "req_skills": "",
    "location": "BLR",
    "status": "open",
    "job_type": "software",
    "job_description": [
      {
        "key": "What you'll bring:",
        "value": [
          "Bachelor's or Master’s degree in computer science, Engineering, or a related field. ",
          "5+ years of experience in Linux Systems, software development, with a good understanding in Python or Go programming language, Linux Scripting and object-oriented design. ",
          "Proven experience in Hardware Infrastructure, Linux OS Configuration and understanding Kernel & Processor capabilities. ",
          "Experience with cloud platforms and technologies, such as Openstack, Azure, or Google Cloud. ",
          "Familiarity with database design and development, including experience with SQL and NoSQL databases, is a plus. ",
          "Familiarity with version control systems, such as Git or SVN. ",
          "Strong understanding of software development best practices, including design patterns, code quality, and testing methodologies. ",
          "Excellent problem-solving, analytical, and debugging skills. ",
          "Strong communication and interpersonal skills, with the ability to collaborate effectively with cross-functional teams. ",
          "with agile software development methodologies, such as Scrum or Kanban."
        ]
      },
      {
        "key": "What you'll do:",
        "value": [
          "Design, Develop, and provide continuous improvement to handle Cloud Infrastructure Build, Upgrade & Patching. ",
          "Design, develop, and maintain high-quality, scalable, and efficient software solutions to meet business requirements and specifications. 3. Develop/Enhance the code/script to handle Hardware Management & Incident workflow. ",
          "Design and implement efficient monitoring systems for cloud services in a production environment. ",
          "Collaborate with product managers, project managers, and other stakeholders to understand and refine project requirements, ensuring alignment with business objectives. ",
          "Provide technical leadership and mentorship to junior software engineers, fostering a culture of continuous learning and improvement. ",
          "Conduct thorough code reviews to ensure code quality, maintainability, and adherence to best practices. ",
          "Troubleshoot, debug, and resolve complex software issues, providing root cause analysis and implementing long-term solutions. ",
          "Continuously research and stay up-to-date with the latest industry trends, technologies, and best practices, incorporating them into the development process as appropriate. ",
          "Participate in the cloud infrastructure, full software development lifecycle, including requirements gathering, design, development, testing, deployment, and maintenance. ",
          "Develop and maintain technical documentation, including design documents, user guides, and API documentation. ",
          "Work closely with quality assurance teams to develop and execute test plans, ensuring the delivery of high-quality software. ",
          "Contribute to the improvement of software development processes, tools, and methodologies within the organization. ",
          "Provide on-call support as needed, addressing critical issues and ensuring the smooth operation of software applications."
        ]
      },
      {
        "key": "About Team:",
        "value": [
          "The Private Cloud Compute Team is a group of skilled professionals specializing in cloud infrastructure build, management, and automation. We develop and maintain tools to manage & optimize cloud infrastructure, reduce manual tasks, and enhance efficiency. Our goal is to provide reliable, secure, and cost-effective cloud environments, enabling businesses to focus on innovation and growth."
        ]
      }
    ],
    "id": 46
  },
  {
    "company_name": "Harman",
    "position": "INTERN TRAINEE",
    "req_experience": " Basic knowledge about technologies. ",
    "link": "https://jobs.harman.com/en_US/careers/JobDetail/Intern-Trainee/20542",
    "company_logo": "assets/images/harman.gif",
    "skill_vis_check": false,
    "req_skills": "",
    "location": "Gurgaon",
    "status": "open",
    "job_type": "software",
    "job_description": [
      {
        "key": "DESCRIPTION & REQUIREMENTS",
        "value": [
          "Responsibilities",
          "Experience in one technology - C/ Python.",
          "Good to have exposure in Database Management."
        ]
      },
      {
        "key": "Required skills and qualifications:",
        "value": [
          "Basic knowledge about technologies.",
          "Good communication skills"
        ]
      },
      {
        "key": "What We Offer:",
        "value": [
          "Flexible work environment, allowing for full-time remote work globally for positions that can be performed outside a HARMAN or customer location",
          "Access to employee discounts on world-class Harman and Samsung products (JBL, HARMAN Kardon, AKG, etc.)",
          "Extensive training opportunities through our own HARMAN University",
          "Competitive wellness benefits",
          "Tuition Reimbursement",
          "Access to HARMAN Campus Fitness Centre and Cafeteria",
          "An inclusive and diverse work environment that fosters and encourages professional and personal development."
        ]
      },
      {
        "key": "HARMAN is proud to be an Equal Opportunity / Affirmative Action employer. All qualified applicants will receive consideration for employment without regard to race, religion, color, national origin, gender (including pregnancy, childbirth, or related medical conditions), sexual orientation, gender identity, gender expression, age, status as a protected veteran, status as an individual with a disability, or other applicable legally protected characteristics.",
        "value": []
      }
    ],
    "id": 45
  },
  {
    "company_name": "nagarro",
    "position": "Trainee",
    "req_experience": "freshers",
    "link": "https://jobs.smartrecruiters.com/ni/Nagarro1/26076c22-eed6-47bf-a226-e819c6efb9d8-trainee",
    "company_logo": "assets/images/nagarro.gif",
    "skill_vis_check": false,
    "req_skills": "",
    "location": "remote",
    "status": "open",
    "job_type": "software",
    "job_description": [
      {
        "key": "Company Description",
        "value": [
          "We're Nagarro. We are a digital product engineering company that is scaling in a big way! We build products, services, and experiences that inspire, excite, and delight. We work at scale — across all devices and digital mediums, and our people exist everywhere in the world (18,000+ experts across 36 countries, to be exact). Our work culture is dynamic and non-hierarchical. We're looking for great new colleagues. That's where you come in!"
        ]
      },
      {
        "key": "Trainee",
        "value": [
          "Remote, India",
          "Service Region: South Asia"
        ]
      },
      {
        "key": "Education:",
        "value": [
          "Bachelors/University degree or equivalent experience"
        ]
      }
    ],
    "id": 43
  },
  {
    "company_name": "Cisco ",
    "position": "Software Engineer",
    "req_experience": "1-2 years",
    "link": "https://jobs.cisco.com/jobs/ProjectDetail/Software-Engineer-Wireless-Dash-Development-G6-India-Meraki/1419996",
    "company_logo": "assets/images/cisco.gif",
    "skill_vis_check": false,
    "req_skills": "",
    "location": "Bengaluru, Karnataka, India",
    "status": "open",
    "job_type": "software",
    "job_description": [
      {
        "key": "Required Skills",
        "value": [
          "1-2 years employed experience, in addition to BS/MS qualification in Computer Science Engineering or equivalent.",
          "Experienced in Java / Ruby frameworks and React / JavaScript.",
          "Experienced in working with database modelling.",
          "Front and back end (Full-Stack) development",
          "Strong social and interpersonal skills, with a highly developed ability to work with customers to understand their sophisticated networking infrastructure level requirements and design solutions for them."
        ]
      },
      {
        "key": "Bonus Points",
        "value": [
          "Previous Dashboard building projects.",
          "Experience in constructing API endpoints.",
          "Being self-motivated, strong sense of ownership, teammate. You should be able to own large portions of the software from a technical perspective."
        ]
      },
      {
        "key": "Company Description",
        "value": [
          "Cisco is an Affirmative Action and Equal Opportunity Employer, and all qualified applicants will receive consideration for employment without regard to race, colour, religion, gender, sexual orientation, national origin, genetic information, age, disability, veteran status, or any other legally protected basis. Cisco will consider for employment, on a case-by-case basis, qualified applicants with arrest and conviction records.",
          "As the leader in cloud-managed IT, Cisco Meraki connects passionate people to their mission by simplifying the digital workplace. Our impact is driven by the innovative, purposeful, and vibrant people who make up our inclusive community. When technology is intuitive, our customers can focus on what matters. At Cisco Meraki, we’re challenging the status quo with the power of diversity, inclusion, and collaboration. When we connect different perspectives, we can imagine new possibilities, inspire innovation, and release the full potential of our people. We’re building an employee experience that includes appreciation, belonging, growth, and purpose for everyone."
        ]
      },
      {
        "key": "Additional Information",
        "value": [
          "Please note this posting is to advertise potential job opportunities. This exact role may not be open today but could open soon. When you apply, a Cisco representative may contact you directly if a relevant position opens."
        ]
      }
    ],
    "id": 40
  },
  {
    "company_name": "Dassault Systèmes ",
    "position": "Java Developer",
    "req_experience": "3+ years",
    "link": "https://www.3ds.com/careers/jobs/java-developer-539254?src=SNS-102",
    "company_logo": "assets/images/dassault systemes.gif",
    "skill_vis_check": false,
    "req_skills": "",
    "location": "Pune, India",
    "status": "open",
    "job_type": "software",
    "job_description": [
      {
        "key": "Imagine New Horizons",
        "value": [
          "We are looking for experienced Front End Developer who can deliver world-class enterprise solutions by developing applications and services in domains of Sales, Finance, People and Digital Marketing."
        ]
      },
      {
        "key": "Role Description & Responsibilities",
        "value": [
          "You will work in a highly collaborative environment with Product Management, Define, Other development, QA and DevOps teams",
          "Analyze business requirements and create specifications: - Defining functional behavior, limitations and acceptance tests of the capabilities to deliver and documenting in PES (Product Enhancement Specification Document)",
          "Design and specify how capabilities will be implemented: - Select algorithms, theories and technologies that will be used and document in DES (Design Enhancement Specification Document)",
          "Identify and manage dependencies with other components",
          "Provide implementation cost estimations and help in building a realistic delivery plan",
          "Develop code & unit tests, validate new functionalities described in PES and run unit tests according to implement process as defined in development pipeline",
          "Leverage agile methodologies to anticipate and mitigate risks and ensure timely delivery of the implementations",
          "Advocate for and apply good technical practices such as continuous integration, test automation, automated infrastructure and monitoring",
          "Resolution of bugs and incident reports reported by Technical Customer Success or product QA teams",
          "Maintain & Support software in a production environment"
        ]
      },
      {
        "key": "The Challenges ahead",
        "value": [
          "To thrive in a fast-paced environment, appreciate aggressive goals and have a desire-to-win attitude.",
          "The ability to solve tough problems that require innovative solutions"
        ]
      },
      {
        "key": "Qualifications/Experience",
        "value": [
          "Engineering or MCA with 60% through out in all academics with 0-90 Days’ notice period",
          "2-5 years development experience in Java Script, HTML, CSS, Typescript and Web Technologies",
          "Experience in Vue.JS & PHP is preferable",
          "Experience working with code repositories such as Git, SVN",
          "Experience with Continuous Integration tools like Jenkin"
        ]
      },
      {
        "key": "Company Description",
        "value": [
          "As a game-changer in sustainable technology and innovation, Dassault Systèmes is striving to build more inclusive and diverse teams across the globe. We believe that our people are our number one asset and we want all employees to feel empowered to bring their whole selves to work every day. It is our goal that our people feel a sense of pride and a passion for belonging. As a company leading change, it’s our responsibility to foster opportunities for all people to participate in a harmonized Workforce of the Future."
        ]
      }
    ],
    "id": 39
  },
  {
    "company_name": "Microsoft ",
    "position": "Software Engineer 1",
    "req_experience": "1+ year",
    "link": "https://jobs.careers.microsoft.com/us/en/job/1719540/Software-Engineer-I",
    "company_logo": "assets/images/microsoft.gif",
    "skill_vis_check": false,
    "req_skills": "",
    "location": "BLR",
    "status": "open",
    "job_type": "software",
    "job_description": [
      {
        "key": "Overview",
        "value": [
          "This opportunity will allow you to closely work with other engineers, managers, product, design and operations teams to create solutions that meet business requirements, and to drive engineering and operational excellence in Viva Glint. You will be able to work on Glint’s core feature set driven by analytics and reporting.",
          "Microsoft’s mission is to empower every person and every organization on the planet to achieve more. As employees we come together with a growth mindset, innovate to empower others, and collaborate to realize our shared goals. Each day we build on our values of respect, integrity, and accountability to create a culture of inclusion where everyone can thrive at work and beyond."
        ]
      },
      {
        "key": "Responsibilities",
        "value": [
          "Works with stakeholders to determine service and user requirements for a set of features, including but not limited to analytics, reporting and big data systems.  ",
          "Contributes to the identification of dependencies, and the development of design documents for a product area with little oversight.  ",
          "Creates and implements code to enable Viva Glint service or feature, reusing code as applicable.  ",
          "Contributes to efforts to break down larger work items into smaller work items and provides estimation.  ",
          "Acts as a Designated Responsible Individual (DRI) working on-call to monitor system/product feature/service for degradation, downtime, or interruptions and gains approval to restore system/product/service for simple problems.  ",
          "Remains current in skills by investing time and effort into staying abreast of current developments that will improve the availability, reliability, efficiency, observability, and performance of products while also driving consistency in monitoring and operations at scale.  ",
          "Embodies our culture and values. "
        ]
      },
      {
        "key": "Required Qualifications:",
        "value": [
          "Bachelor's Degree in Computer Science, or related technical discipline with proven experience coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python",
          "OR equivalent experience."
        ]
      },
      {
        "key": "Other Requirements:",
        "value": [
          "Ability to meet Microsoft, customer and/or government security screening requirements are required for this role. These requirements include but are not limited to the following specialized security screenings:",
          "Microsoft Cloud Background Check: This position will be required to pass the Microsoft Cloud background check upon hire/transfer and every two years thereafter."
        ]
      },
      {
        "key": "Preferred Qualfications:",
        "value": [
          "Bachelor’s degree in computer science or related technical field AND 1+ years technical engineering experience with coding in languages including, but not limited to C#, Java, JavaScript, or Python  OR master’s degree in computer science or related technical field AND 1+ years technical engineering experience with coding in languages including, but not limited to C#, Java, JavaScript, or Python or equivalent experience. ",
          "1+ years' experience building backend systems in Java for customer-facing web applications, including API design and implementation.  ",
          "Experience with (or enthusiasm for learning) ETL, analytics and reporting backend patterns and systems. ",
          "Experience writing queries with SQL and using MySQL. ",
          "Experience working with LLMs and prompt engineering. ",
          "Proficiency in writing unit tests. "
        ]
      }
    ],
    "id": 35
  }
  ]
}